[
  {
    "airline_name": "Advanced Air Notes",
    "url": "https://stafftraveler.com/en/notes/WSN",
    "refunds": " Please contact support only if you encounter an error when requesting for refund or if you are still waiting for your refund 30 days after your request. Authorized languages are English or French only.",
    "special": " American Express Card not permitted A5 request to buy only OW ticket on A5 flight. If not, the partial refund will not guaranty in 30 days.",
    "email info": " interline@hop.fr",
    "refunds email": " interline@hop.fr",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Advanced Air staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Aegean Airlines Notes",
    "url": "https://stafftraveler.com/en/notes/AEE",
    "important": " Covid-19 related info for Aegean: https://en.aegeanair.com/aegean-announcement/ All passengers travelling on international flights to Greece must fill in & submit the special Passenger Locator Form electronically, latest the day before entering the country. https://en.aegeanair.com/passenger-locator-form/",
    "baggage": " As per aegeanair.com aegeanair.com",
    "dress code": " Travelers in worn-out, dirty or torn clothes, beach attire, jogging outfit etc. will not be accepted on board.",
    "listing": " E-tickets not issued via myIDTravel, listing 2 hours before flight at the airport",
    "boarding": " ZED passengers will have lower priority over A3 revenue passengers. A3 staff will have a higher priority over other airline staff holding ZED tickets.",
    "upgrade": " Not permitted",
    "special": " Special meals Special meals It is not possible to pre-book special meal for rebate/standby passengers. Seat requests Seat requests Seat requests are not permitted on Staff Travel. Unaccompanied minors Unaccompanied minors Not permitted. Other Other No other Special service requests is permitted when travelling on Standby/Space Available tickets.",
    "excluded flights": " All flights not operated by A3",
    "visa": " Travelling staff/family should ensure that they hold valid passport and relevant visas for their intended destination and/or scheduled point en route, in case off-loading becomes necessary. In the absence of valid passport/visa staff passengers may be denied boarding.",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Aegean Airlines staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Aer Lingus Notes",
    "url": "https://stafftraveler.com/en/notes/EIN",
    "important": " Loads given for Short/Medium Haul routes will include Business (AerSpace) on applicable routes as well as Economy. On Long Haul services Business and Economy seats will be shown. Aer Lingus generally will only upgrade on a space available basis for Economy. Listed loads are available on the day at check-in.",
    "baggage": " Staff are allowed to have a maximum of 1 free bag at 20kg check-in luggage and 10kg hand luggage (7kg on EI regional flights) on UK and Europe flights, and a maximum of 2 pieces upto 36kg on USA flights. Excess charges will apply if Staff are over the baggage allowance and if bringing Golf Clubs/Skis or other oversized items. On busy flights staff may be asked to check in their large hand luggage items at the boarding gate, please comply with any ground staff requests.",
    "dress code": " All concession travelers must in general be neat, clean and tidy. They must, of course, be dressed within public standards of good taste. This means that clothing such as Jeans may be worn if they meet this standard. The decisions by airport staff on the acceptability of particular attire and the interpretation of these regulations is final. The main criteria is that staff should be dressed in a way so that they do not stand out from other passengers. Travel will be refused if dress code standards are not met.",
    "check-in": " Check-In at Dublin is only available by the standby desk in T2 Dublin. No online or app functionality.",
    "website": " www.aerlingus.com",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Aer Lingus staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Aeroflot Notes",
    "url": "https://stafftraveler.com/en/notes/AFL",
    "important": " The data may be inaccurate due to system restrictions: the system only shows the original booked SU own staff on the flight (not rebooked and not ZED staff) and a minimum shown seat is ZERO. The system does not show overbookings.",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Aeroflot staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Aerolineas Argentinas Notes",
    "url": "https://stafftraveler.com/en/notes/ARG",
    "general": " The standby list opens 4 hours before the ETD for all flights.",
    "listing": " Listing is mandatory on AR flights. Listing is automatically created when purchasing your e-ticket. If your original travel listing date has passed, you must access your ticket on myIDTravel and list again for your new travel date.",
    "included flights": " All flights operated by Austral Líneas Aéreas (AU) are included in this Agreement.",
    "excluded flights": " Flights numbered AR10XX (e.g. AR1090) are cargo or ferry flights that do not accept passengers.",
    "email info": " myidtravel@aerolineas.com.ar",
    "refunds email": " myidtravel@aerolineas.com.ar",
    "website": " www.aerolineas.com.ar/",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Aerolineas Argentinas staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Aeromexico Notes",
    "url": "https://stafftraveler.com/en/notes/AMX",
    "important": " The number of listed non-rev pax may not be available.",
    "baggage": " One piece 50 lbs. /23 kg",
    "dress code": " All non-rev guests are expected to dress in good taste when traveling on Aeromexico, nothing less than smart casual.",
    "listing": " Listing is mandatory on Aeromexico flights. For e-tickets beginning with ticket number 139 issued through myIDTravel, listing is automatically created when purchasing your eticket. If your original travel listing date has passed, you must access your ticket on myIDTravel and list again for your new travel date. Once the payment is validated, you will automatically receive an itinerary receipt by email. For e-tickets beginning with a ticket number that is NOT 139 (through myIDTravel or any other system), passengers may list at Aeromexico's counter the day of travel at least 120 minutes for international departures and 90 minutes for domestic departures.",
    "check-in": " Non-rev passengers are required to check-in at Aeromexico's ticket counter at least 90 minutes prior for domestic departures and 120 minutes for international departures.",
    "upgrade": " Upgrade do not apply for leisure stand by tickets",
    "refunds": " Refund requests for wholly and partially unused tickets will be processed automatically and the myIDTravel fee will be refunded. Refund requests for tickets when the first segment is unused and the others segments are used will be processed manually and may take some time. If you encounter an issue during the refund ticket process, please send a message to ammyidtravel@aeromexico.com ammyidtravel@aeromexico.com To retrieve your e-ticket for refunds please use only the first 13 digits on the ticket number",
    "excluded flights": " All code shares and flights not operated by Aeromexico and AM Connect",
    "visa": " Passengers are responsible for obtaining all necessary travel documents, including visas and specific permits which may be required under the legal and regulatory provisions in force in departure, arrival and transit states, and must comply with the requirements of the authorities of these countries regarding immigration and border checks. The carrier may not be held liable for the consequences suffered by passengers in the event of failure to comply with the obligations referred to in the paragraph above.",
    "email info": " ammyidtravel@aeromexico.com",
    "refunds email": " ammyidtravel@aeromexico.com",
    "website": " www.aeromexico.com",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Aeromexico staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Air Arabia Notes",
    "url": "https://stafftraveler.com/en/notes/ABY",
    "important": " Seat availability is not visible to Air Arabia crew until 6 hours prior to departure.",
    "general": " Crew must ensure their communication with the check in staff must be professional all the time. The crew should not argue with the check in staff at the counter and must be patient until they have been accepted on their respective flight.",
    "dress code": " Employees while traveling on discounted/rebated or non-revenue tickets should follow the dress code prescribed below Acceptable Attire which is clean and well maintained. Business Attire, smart casual attires, shirts with sleeves and collars, tee-shirts, jeans/denims, slacks, skirts, dresses, Close shoes (flats & with heels), open-toe shoes, and sneakers. Acceptable Not Acceptable Attire that is ragged slashed, dirty, frayed, low cut, skimpy, or revealing. Faded clothing, muscle shirts, strapless dresses, sleeveless tops, shorts, shirts with unacceptable slogans, logos or large-letter advertising, torn clothing, casual clothing that may be offensive to others – words, pictures or logos. Attire with sexually oriented inscriptions or messages, halter/tube/midriff tops, sweats of any kind, leggings, beach or swim wear, flip flops and shoes that are dirty, stained, or worn in appearance. Not Acceptable",
    "general phone number": " +97165088825",
    "email info": " stafftravel@airarabia.com",
    "website": " www.airarabia.com",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Air Arabia staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Air Canada Notes",
    "url": "https://stafftraveler.com/en/notes/ACA",
    "important": " AC employees only see the total number of standbys and upgrades at checkin (I.e 24 hours) before departure. AC doesn't identify who's Rev and Non-Rev. Hence we have to identify Non-Rev by name (first 3 letters of last name) on standby list, against Rev (also first 3 letters of last name) on upgrade list, and subtract. This can lead to mistakes. Ensure non-revs are entered correctly, as standby revenue pax for upgrades to J or O class do not count as non revs standing by for the flight",
    "baggage": " Same baggage rules applies as per regular full-fare passengers. Refer to www.aircanada.com www.aircanada.com Baggage Policy for Travel from China In order to support the Federal Government in it's efforts to reduce the risk of Federal Law violations due to the importation of counterfeit goods (i.e. 'knock-offs'), Air Canada will be introducing a maximum allowance of one, checked bag per person for non-revenue travel, when traveling on stand-by from China on Air Canada. Please note this represents the maximum allowance permitted, therefore it cannot be exceeded under any circumstances (this means that oversize/overweight pieces will not be accepted). The policy will come in effect on June 1, 2012, and will apply to all stand-by passengers boarding Air Canada flights in China. Boeing 777-300 (77P) aircrafts -are required to limit their carry-on to one personal item, such as a purse or laptop case. Employees traveling with babies will be able to board the plane with two personal items (i.e. one purse, one diaper bag). Duty Free purchases are not exception and must fit inside your personal item. Air Canada Rouge - YYZ-KIN-YYZ - One carry on item and one checked bag permitted on this flights only per passenger.",
    "dress code": " Employee travel dress code A clean, neat and professional appearance reinforces our brand and our world-class products and services. How we present ourselves is as important and distinctive as our logo and signals to our customers that we strive to be the very best at what we do. In the spirit of modernizing our employee dress code policy, we want to empower our employees to dress with care, class and common sense when travelling with Air Canada. Scope This policy is applicable to all employees, retirees, eligible family members and friends. Policy Statement The intent of this policy is to equip employees with general guidelines when dressing for travel. Guidelines When Travelling for Business or Leisure Air Canada's dress code is designed to respect and reflect our brand image, while allowing employees the flexibility to travel comfortably. Whether employees are travelling for business or leisure, their appearance must be clean and appropriate for the activities or meetings scheduled for their day. Any clothing that is stained, dirty, transparent, torn, revealing, or otherwise compromises a neat appearance, is not permitted. Dress with “care, class and common sense”. In other words, employees have the discretion to make their clothing choice based on what is appropriate. Employees must use common sense in their choice of attire. When travelling on other airlines, employees should follow the other airlines’ dress code guidelines. Employees should contact the airline directly before they travel to inquire about their dress code. We trust that employees will make the right choices. In case of uncertainty, employees are free to consult with our Travel Care Team at actravel.voyageac@aircanada.ca. Non-Compliance with the Policy Employees are personally held accountable for their attire and the attire of friends and family members when traveling on pass privileges. Incidents of non-compliance (Air Canada employees and family members or employees from other airlines) should be reported to the Travel and Recognition department at: actravel.voyageac@aircanada.ca. Failure to comply with any information contained in this policy will result in the suspension of travel pass privileges",
    "check-in": " You can use web check-in and our self-service kiosk Through check-in is not available for stand-by passengers.",
    "boarding": " When there are two or more interline employees travelling on the same flight, the date of listing by the reservation department will determine the onload/offload and the cabin upgrade/downgrade order.",
    "upgrade": " Non-revs are upgraded after revenue passengers. If economy is full, the non-rev will automatically be put into the next class of service that has available seats (premium economy or business class), regardless of what class of service they listed themselves on. Air Canada does not leave non-revs behind if there are seats open in business or premium economy, but not in economy.",
    "excluded flights": " All codeshare flights Air Canada Vacations charter",
    "general phone number": " +1 888 247 2262",
    "listing phone number": " +1 888 247 2262",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Air Canada staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Air China Notes",
    "url": "https://stafftraveler.com/en/notes/CCA",
    "website": " www.airchina.com.cn/",
    "email domain": " airchina.com.cn",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Air China staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Air Europa Notes",
    "url": "https://stafftraveler.com/en/notes/AEA",
    "website": " www.aireuropa.com/",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Air Europa staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Air France Notes",
    "url": "https://stafftraveler.com/en/notes/AFR",
    "general": " Before departure, please always consult AF website (airfrance.fr) to have knowledge of legal conditions when booking on AF flights and to check if your flight is operated. airfrance.fr It is highly recommended as well to check country of destination immigration requirements (ex: recently published South Africa requirements about minors)",
    "baggage": " Before departure, please always consult AF website (airfrance.fr) to have knowledge of prohibited items. airfrance.fr Applicable baggage allowance is indicated on the itinerary receipt (1PC of 23kg maximum). Only hand luggage complying with following conditions will be accepted on board: 1 hand luggage 35x55x25cm + 1 accessory with a total weight of 12kg maximum. In case of non compliance, hand luggage will be collected at boarding gate and put in the hold. When traveling with Air France via Paris-Charles de Gaulle (CDG) or Paris-Orly (ORY), please be aware that your checked baggage might not be automatically transferred to your onward flight. To ensure a smooth connection, it’s advisable to schedule a layover that allows sufficient time to retrieve your baggage from the carousel, clear any necessary customs checks, and then re-check it for your final destination.",
    "listing": " Listing/booking on AF flights is authorized only 30 days before travel date.",
    "refunds": " Please contact support only if you encounter an error when requesting for refund or if you are still waiting for your refund 30 days after your request. Authorized languages are English or French only. Refunds can be requested until 1 year after date of issuance. For confirmed leisure tickets reservations must be cancelled 10 prior to departure on long hauls and 5 days for short and medium hauls, should transportation not to be required. Refunds after this period are not permitted except for taxes.",
    "included flights": " All flights leased by AF from other carriers, especially from DB, YS, AN and WX as well are eligible: XX*AF coded flights within GDS",
    "excluded flights": " All code-share flights are excluded, including AF block seats allotments when flight operated by the other carrier (XX:AF)",
    "email info": " help@blk-contactcenter.com",
    "refunds email": " help@blk-contactcenter.com",
    "website": " www.airfrance.com",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Air France staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Air India Notes",
    "url": "https://stafftraveler.com/en/notes/AIC",
    "baggage": " 20 KG for weight concept",
    "listing": " Air India allow ZED ticket for its employees. Listing for ZED travel on Air India has now been made mandatory. All Standby travelers will be required to call the AI Call Centre to list themselves at least 24 hours prior to departure. +91 124-2641407",
    "check-in": " Three hours prior departure",
    "excluded flights": " All code share flights between the numbers 3000 and 9999",
    "embargoes": " See flyzef.info flyzef.info",
    "general phone number": " +91 22 25818515",
    "listing phone number": " +91 22 25818515",
    "email info": " ecommerce@airindia.in",
    "refunds email": " ecommerce@airindia.in",
    "website": " www.airindia.in",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Air India staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Air Inuit Notes",
    "url": "https://stafftraveler.com/en/notes/AIE",
    "general": " OPENING HOURS Mon-Fri : 10am – 5:30pm Sat-Sun and State Holidays : CLOSED",
    "infants": " Infant tickets have to be issued and/or changed directly with our travel desk. The request has to be done by email at employes-staff@airinuit.com. employes-staff@airinuit.com To have an infant ticket issued the following information has to be provided:",
    "general phone number": " +514 905 9445 ext-6282",
    "listing phone number": " +1 800 361 5933 ext-6282",
    "email info": " employes-staff@airinuit.com",
    "refunds email": " mplante@airinuit.com",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Air Inuit staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Air Mauritius Notes",
    "url": "https://stafftraveler.com/en/notes/MAU",
    "website": " www.airmauritius.com/",
    "email domain": " airmauritius.com",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Air Mauritius staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Air New Zealand Notes",
    "url": "https://stafftraveler.com/en/notes/ANZ",
    "important": " Most NZ employees only have access to the loads 2 days in advance and getting the number of listed pax is not guaranteed as only a small fraction of staff have access to this information.",
    "general": " Staff from your airline can travel on NZ flights operated by Air New Zealand. Travel includes flights on Air NZ Link airlines (regional airlines within New Zealand): Eagle Airways, Air Nelson and Mount Cook Airline. All have flight numbers commencing with NZ. Economy is the only class operated by Air NZ for New Zealand Domestic, and most trans-Tasman and Pacific Islands flights. AIR NZ’s Premium Economy class (O class) is not able to be booked using myIDTravel. During periods of high commercial demand, Air NZ may temporarily exclude (embargo) flights for interline staff travellers. No bus, train or ferry services are included. Fares will not earn Air New Zealand Airpoints or status points. Paid seat selection is not available. Pre-paid extra baggage is not available but can be purchased at the airport. Infants do not get a separate baggage allowance. An infant and/or child is permitted to carry a stroller and/or car seat free of charge. Meal selection is not available, for example vegetarian, allergy-free meals. Standby travel is popular on Air NZ. If you need certainty for your travel, it is recommended you purchase a commercial fare at www.airnewzealand.com. Standby travel departing Nelson (NSN), New Zealand: - Please be aware that due to payload restrictions, standby Staff Travel opportunities from Nelson on weekdays (Monday to Friday, excluding public holidays) on flights departing between 0800 and 1700 NZT are limited if you have checked luggage. We suggest that if you are intending to travel through this time, you travel either with cabin baggage only, or purchase a commercial fare at www.airnewzealand.com. NZ0002 AKL-JFK is typically weight restricted due to the long distance.",
    "baggage": " Checked baggage allowance is one [1] piece per person up to a maximum of 23kg per piece. This is for domestic, Trans-Tasman, Pacific Islands and most long haul flights with the exception of flights to Singapore, Taipei and Shanghai which allow two [2] checked bags at a maximum of 23kg per piece. Extra pieces can be purchased at the airport at the normal airport excess baggage rate. Infants do not get a separate baggage allowance. An infant is permitted to carry a stroller and/or car seat free of charge.",
    "dress code": " A high standard of dress is required by everyone traveling on staff travel. As a guideline the following are not acceptable: tracksuits, frayed or patched jeans, singlet tops, sandals (flip flops), bare midriffs or bare feet. Smart casual shorts are acceptable. Dress jeans can be worn in the premium cabins. - Airport staff have the ability to deny loading and/or upgrades if they consider your standard of dress is not acceptable. - If your agreement allows travel in the upper cabins, a higher standard of dress is required for upgrades such as business attire. Airport staff have authority to decline upgrades on this basis.",
    "check-in": " You cannot check in online. You must travel to airport and arrive 2 hours prior to flight departure to check in. And then seats are assigned after check in closes.",
    "refunds": " Full Refunds will be processed automatically with the myIDTravel fee will be refunded. - Partial Refund requests will be processed manually and may take some time. The myIDTravel fee is not refundable for partially used tickets. - A ticket is considered \"expired\" after one year from date of issue. After a year, the ticket has no value and is not eligible to be reissued or refunded. - If contacting Air NZ Refunds for assistance, please provide your airline code, employee ID, name, booking reference(s) (PNR) and ticket number(s).",
    "website": " www.airnewzealand.com/",
    "email domain": " airnz.co.nz",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Air New Zealand staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Air Transat Notes",
    "url": "https://stafftraveler.com/en/notes/TSC",
    "important": " Loads are available 1 month prior to departure. Note that staff does not have access to the number of standby passengers or how many are listed.",
    "website": " www.transat.com",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Air Transat staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Aircalin Notes",
    "url": "https://stafftraveler.com/en/notes/ACI",
    "website": " www.aircalin.com",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Aircalin staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Alaska Airlines Notes",
    "url": "https://stafftraveler.com/en/notes/ASA",
    "baggage": " Other airline employees will not be charged for the first two checked bags. However, non-revs must pay all excess and overweight charges. Each bag must weigh 50 pounds or less and have a maximum dimension of 62 linear inches (length + height + width) to avoid additional charges. Baggage charges can be paid at the ticket counter. Non-revs whose checked bags do not arrive will get free delivery.",
    "dress code": " The dress code on both Alaska and Horizon is casual and the requirement is simply a neat and well groomed appearance. Clothing that is soiled or tattered and bare feet are never acceptable. Employees and travel eligibles are expected to use their own good judgment but customer service agents will have the final authority to refuse travel for inappropriate attire or appearance.",
    "listing": " Other airline employees can list for Alaska Airlines pleasure travel flights online at ifc.id90.com. Select your airline from the dropdown. ifc.id90.com Username: your airline code + emp (e.g. asemp) Password: your airline billing code (e.g. 027)",
    "check-in": " Employees who list online, can check-in via the web at alaskaair.com or at an airport kiosk location. alaskaair.com After check in at the ticket counter, your name is put on the standby list. Standby travelers must be checked in and available to board at the designated boarding gate at least 40 minutes before posted departure for all flights. If a seat is available, your name is called at the gate.",
    "boarding": " Non revs board in order of zone",
    "upgrade": " When economy cabin space is full and premium or first is available non revs will be moved to the next class",
    "special": " Pets<br> The AVIH (Animal in Hold)/ PETC (Pet in Cabin) fee applies to other airline non-revenue travelers. Passengers must be 18 years old to travel with PETC. All health requirements need to be met for the animal. Pets will be tagged standby and when the non-revenue passenger clears the flight the animal is also cleared. Do not call to list the animal. It is suggested that you contact Alaska Reservations to check the number of confirmed Pets on the flight as there is a limited number of animals in the cabin. Pets Second Seat Policy<br> The requirement of being able to fit within one seat with the armrests in the down position will apply to every passenger on our aircraft including non-revenue passengers. However, our non-revenue passengers will not be required to purchase an additional seat. All non-revenue passengers are required to advise the gate agent of their need for a second seat at the gate. If they do, the second seat will be blocked based on their boarding priority code. Since other airline travelers are not charged for the second seat, a courtesy block will be used on the adjacent seat. Second Seat Policy Meals and DigE players<br> Meals in coach class are available for purchase using your credit or debit card (this also applies to DigE players) on flights more than three and a half hours long. Meals and DigE players Seat Requests<br> In all instances, standby passengers should sit in their assigned seat and not request that other passengers relocate for your convenience. There is a possible chance that you and your party may be separated on the plane, so either prepare for this or take another flight that would better accommodate your needs. Seat Requests Infant safety seats<br> Lap infants sharing a seat with their parent may bring a child restraint seat on board provided there is an empty seat available for the infant. If the flight is full, the car seat will be checked at the gate using a claim-at-gate tag. The car seat will be returned to you at the gate upon arrival. All car seats must be FAA approved for aircraft use. Infant safety seats Unaccompanied minors<br> Under 16 years not permitted to travel alone on a ZED ticket. Unaccompanied minors",
    "infants": " Infant tickets are not required for travel within the United States. For travel to/from Mexico and Canada, please see a Customer Service Agent at any Alaska Airlines ticket counter for infant ticketing. We cannot accept infant e-tickets from other airlines.",
    "included flights": " Travel is valid on flights operated by Alaska Airlines and flights operated by Horizon Air, Skywest, and PenAir marketed/sold as Alaska Airline flights.",
    "visa": " All travelers must present government-issued photo ID such as a driver's license or passport. Whenever you travel as a non-revenue passenger you will need to present your employee photo ID badge at check-in. Dependents age 16 and over, will need to provide government photo ID such as a driver's license or passport. For travel to Mexico or Canada or any other destinations outside of the USA, proof of citizenship is also required for every traveler. A passport is the identification needed for Canada and Mexico, and is required for other international destinations.",
    "website": " www.alaskaair.com",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Alaska Airlines staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Allegiant Air Notes",
    "url": "https://stafftraveler.com/en/notes/AAY",
    "important": " Most Allegiant employees cannot see the number of non-revs from other airlines. When they enter non-rev numbers, it only includes Allegiant employee non-revs and non-revs that purchased the ticket. OAL Jumpseaters are only shown in gate agent's system on the day of departure.",
    "website": " www.allegiantair.com",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Allegiant Air staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "American Airlines Notes",
    "url": "https://stafftraveler.com/en/notes/AAL",
    "general": " The employee is responsible for ensuring that any of his/her eligible nominees travelling under staff travel agreements are aware of all the requirements that apply to standby travel. Any reference to employee below shall be deemed to include employees, retirees and their respective eligible nominees where applicable. Employees are responsible for checking embargoes before travel. Issuance of a ticket and/or creation of a listing do not guarantee that an embargo does not exist.",
    "baggage": " Please limit checked and carry-on baggage to the number and size allowed for revenue customers. You may have: One (1) carry-on item One (1) personal item (purse, briefcase, laptop, small backpack, or other similar items) You may check two (2) bags free of charge per person on all domestic and most international flights. The maximum baggage size is 50 lbs. and 62 inches (length + width + height). Strollers and car seats are exempt from excess baggage fees and do not count toward your allowable total. If you exceed the free baggage allowance, you will need to pay the same excess baggage charges (www.aa.com/i18n/travel-info/baggage/checked-baggage-policy.jsp) our revenue customers pay for any bags above the free allowance, overweight or oversized.",
    "dress code": " For most of us, being comfortable in flight extends to the clothes we wear. American doesn't have a prescribed dress code for our non-revenue guests. So, as long as your clothing is neat and clean and doesn't offend or distract, you're good to fly in any class (including premium cabins). If you're looking for more specifics, here are a few: When we say offensive or distractive, we mean you shouldn't wear anything that's overly revealing (like super short shorts or something that is sheer or see through). That also extends to swimwear or sleepwear (of course it's always okay to change into your American-provided pajamas if you're lucky to snag a First Class seat on a premium international flight!) It also means to avoid any attire that is vulgar or violates community standards of decency When in doubt, ask yourself, \"Do I blend in with customers?\" If so, you're probably set If you're traveling for the company, business or business casual clothing is encouraged. And, jumpseat riders should consult their operating department, Flight Manual or leader for dress guidelines. Unless travel requires that a company badge be worn (like travel when occupying the jumpseat), team members and retirees should not wear company or security badges when traveling non-revenue or on a confirmed space business ticket.",
    "listing": " Flight listing is required for all standby passengers. Passengers without a flight listing will be denied check-in. Jump seat listings can be made through myidtravel.com/myidlisting or 1-888-weflyaa option 4. myidtravel.com/myidlisting Flight listings must be made at least 48 hours in advance of travel for international flights and 12 hours in advance for all other flights. To list: CONTACT YOUR AIRLINE PASS BUREAU TO OBTAIN THE APPLICABLE USER ID AND PASSWORD Your ticket is valid on any American and American Eagle flight in the market ticketed, regardless of the flight number and/or date shown on the ticket, within the 90 day validity of the ticket. It is not necessary that you create a listing for each flight on which you think you'll attempt to travel. Your sponsoring employee/retiree is responsible for checking flight availability and creating your flight listing at least 72 hours prior to departure. Once you have been flight listed and receive the PNR details, you can: Ask your sponsoring employee/retiree to check you in on our travel system and email your boarding pass or Priority Verification Card (PVC) to you. Use the self-service machines available at most airports to check your bags and receive the Priority Verification Card (PVC) up to 24-hours prior to departure. A credit card is usually required for identification purposes only. If no self-service machines are available you may check in with an agent. When checking in with an agent, please note: First class/Business class/Premium Economy class Check-In lanes are for revenue customers only. You should introduce yourself as a non-rev traveler. Once you've been checked in: You will receive a Priority Verification Card (PVC) to enter through the security checkpoint. Please enter through the Main security lanes, unless you have TSA pre-check printed on your PVC. You may obtain gate and time information at www.aa.com or by calling 800-223-5436. Upon reaching the departure area for your flight, please take a seat and wait for your name to be called by the gate agent. Please do not attempt to use company phones or computers. If time permits and you are an Admirals Club member, feel free to visit the club prior to your flight. When you are accommodated for a flight, we ask that you board the aircraft when directed. Be prepared to gate check your roller board carry-on if the flight is full. Once onboard: Place your personal item underneath your assigned seat to assist with luggage space. Non-rev travelers should not ask for special services or considerations, such as complimentary food items or alcoholic drinks. Exception - If you require medical aid during flight please advise a crew member. If you are not accommodated on your desired flight the agent will roll you over to the next flight. If you need assistance with an alternate option please contact your sponsoring employee/retiree prior to asking the gate agents for assistance.",
    "check-in": " For space-available (or 'standby' or 'subload') personal travel, employees may check in up to twenty four hours before departure at an airport ticket office. To allow for added security procedures, employees must check-in no later than 60 minutes for domestic travel and 90 minutes for international. You may check-in at American's Economy class counter only. You will be automatically checked in on all down-line flights, provided all segments are contained in a single PNR. You will not need to check-in again at connecting AA cities.",
    "boarding": " Employees of other airlines (except OneWorld) and their eligible travelers will be accommodated on American at priority 'ZED', after American's own employees and their guests on personal travel. Boarding will be based on time of check-in. Date of joining will not be a factor. If American is not able to accommodate you on the flight requested, our agents will 'roll' you to the next American operating flight. You will retain your original time of check-in for processing from the priority list.",
    "refunds": " Thank you. You refund request will be processed by American as soon as possible. Please note that once processed, the refund may not post to your account right away, it can take up to two billing cycles for it to appear, depending on the credit card used and the credit card company's processing procedures. myIDTravel@AA.com myIDTravel@AA.com",
    "special": " Employees with disabilities are eligible for similar support services offered to American's revenue passengers. Services offered (free of charge): Services offered (free of charge): Meet and assist Courtesy wheelchairs Checked personal wheelchairs Special packaging for wheelchair batteries Assistance with connecting flights If a seat has been assigned, employees may pre-board a flight as needed. Services offered (with a charge): Services offered (with a charge): Services NOT offered: Services NOT offered: Special meals Pre-reserved seating Peanut removal for those with peanut allergies Employees should contact AA at 1-888-WE-FLY-AA to have their reservation record updated with the special service request. Employees traveling with a battery-powered wheelchair or requiring therapeutic oxygen should contact American reservations in advance of travel to allow for preparation in accommodating the wheelchair or oxygen. Requests for therapeutic oxygen will require an accompanying doctor's statement.",
    "included flights": " Travel is valid on flights operated by American Airlines and all flights marketed/sold as American Eagle",
    "excluded flights": " Travel is not valid on flights marketed by American (AA) and operated by carriers other than those listed above (i.e. code-share).",
    "visa": " Advance passenger information (APIS) will be collected by American at the time of check-in, when required. Employees should allow for sufficient time prior to departure to provide this information. Employees and their eligible travelers are expected to hold all pertinent travel documents such as passport, visas and health certificate required by the country of destination and for every point en route, in case offloading should become necessary for commercial or other reasons. AA reserves the right to deny boarding to any traveler who does not hold the appropriate documents for any point to be transited on route.",
    "listing phone number": " 1-888-weflyaa option 4",
    "email info": " myidtravel@aa.com",
    "refunds email": " myidtravel@aa.com",
    "website": " www.aa.com",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your American Airlines staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "ANA Notes",
    "url": "https://stafftraveler.com/en/notes/ANA",
    "website": " www.ana.co.jp",
    "email domain": " ana.co.jp",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your ANA staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Asiana Airlines Notes",
    "url": "https://stafftraveler.com/en/notes/AAR",
    "important": " OZ doesn’t show OAL non-rev listings, so if you non-rev numbers might not include you.",
    "general": " Asiana Airlines employee system only shows it's own staff listing. Non-rev number shown here may not include the OAL listing, and can be different. Only few staff can access the accurate number with OAL nonrev included.",
    "baggage": " Some as Economy class passenger allowance for the route.",
    "listing": " Listing for non-rev closes 60 minutes before for international flights and 30 minutes before for domestic flights.",
    "check-in": " Check-in counter is located as below: ICN (Seoul/Incheon): B16, Terminal 1 GMP (Seoul/Gimpo): 02, Domestic Terminal GMP (Seoul/Gimpo): A11~13, International Terminal CJU (Jeju) : 01 ICN (Seoul/Incheon): GMP (Seoul/Gimpo): GMP (Seoul/Gimpo): CJU (Jeju) :",
    "upgrade": " If there are available seats in Business class, Asiana airlines can upgrade revenue passengers to accept non-rev passengers, but it depends whether the operational conditions allow it. Non-revenue passengers have access to seats in the Economy class only.",
    "email domain": " flyasiana.com",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Asiana Airlines staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Austrian Notes",
    "url": "https://stafftraveler.com/en/notes/AUA",
    "baggage": " Same baggage allowance as for full fare passengers applies.",
    "dress code": " Staff and their family members shall: NOTE: Austrian reserves the right to refuse boarding to anyone traveling on Staff Travel Concessions whom it deems has to adhered to the Staff Travel Dress code Policy. Eligible Persons travelling under the terms of this agreement must ensure that their appearance and behavior are in line with the Transporting Airline's policy. Eligible Persons must ensure that no inconvenience is given to commercial passengers of the Transporting Airline and that ground staff and cabin crew are not distracted from giving maximum service to such passengers. As a rule, Eligible Persons should be dressed in accordance with public standards of good taste. This will normally mean attire suitable for an office, or smart casual wear. It excludes jeans, T-shirts, sweat-shirts, shorts, gym shoes, and similar extremes of casual wear. Failure to observe the regulations of the Transporting Airline may result in refusal to accept for travel.",
    "listing": " Listing is mandatory. Listing is automatically created when purchasing your e-ticket. If your original travel listing date has passed, you must access your ticket on myIDTravel and list again for your new travel date.",
    "check-in": " Primary Option: via web When not mentioned at least 60 minutes before your scheduled flight departure",
    "upgrade": " Austrian does upgrade paying passengers to accommodate all non-rev travelers.",
    "refunds": " Refund requests for wholly unused tickets will be processed automatically and the myIDTravel fee will be refunded. Refund requests for partially used tickets will be processed manually and may take some time. The myIDTravel fee is not refundable for partially used tickets. IMPORTANT: please send your request in English ONLY",
    "special": "",
    "embargoes": " All train services operated under OS flight number.",
    "visa": " The necessary travel documents such as passport, visa or vaccination certificates must be acquired and their validity must be checked by the traveler before starting the trip. LH accepts no responsibility for missing or invalid documents. Fines imposed to LH, resulting from non-compliance with official requirements, will be borne by the the traveler. For all travel to India and or transiting India a Visa is always required !!",
    "email info": " myidtravel-support@austrian.com",
    "refunds email": " myidtravel-support@austrian.com",
    "website": " www.austrian.com/",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Austrian staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Avianca Notes",
    "url": "https://stafftraveler.com/en/notes/AVA",
    "important": " Loads will not be available until 72 hours prior departure of the flight. Your request will be answered 48 - 72 hours before your flight. Non-rev listings are only available 24 hours before departure.",
    "general": " All changes, cancellations and refund requests should be made via myIDTravel. It is VERY IMPORTANT that you retrieve your PNR in myIDTravel upon receipt of this email and write down your e-ticket numbers. Avianca Reservations and Airport agents have very limited access to assist with listing modifications.",
    "baggage": " All ZED ticket holders are afforded a baggage allowance of one piece per traveler. Each piece must weigh less than 50 pounds (23 kilos), and be smaller than 60 linear inches. Items that are over-size or over-weight will have standard baggage fees applied for acceptance.",
    "dress code": " Acceptable: Attire which is clean, well maintained and in good taste. Shirts with sleeves and collars, skirts, dresses, dress shoes. Not Acceptable: Attire that is torn, ragged, slashed, dirty, frayed, low cut, skimpy, or revealing. Attire with offensive or sexually oriented inscriptions or messages, halter/tube/midriff tops, sweats of any kind, leggings, beach or swim wear, body piercing, tattoos (cover from view), sport shoes and shoes that are dirty, stained, or worn in appearance.",
    "refunds": " To refund a ticket, cancel the itinerary and then retrieve the ticket number and select 'refund'. To verify the refund status or assistance regarding refunds, please contact reembolsosavta@avianca.com reembolsosavta@avianca.com",
    "special": " Special meals requests are not permitted for pass travelers.",
    "infants": " Children under 16 years cannot travel alone; they must be accompanied by an adult travelling on the same type of ticket.",
    "refunds email": " reembolsosavta@avianca.com",
    "website": " avianca.com",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Avianca staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Avianca Costa Rica Notes",
    "url": "https://stafftraveler.com/en/notes/LRC",
    "general": " All changes, cancellations and refund requests should be made via myIDTravel. It is VERY IMPORTANT that you retrieve your PNR in myIDTravel upon receipt of this email and write down your e-ticket numbers. Avianca Reservations and Airport agents have very limited access to assist with listing modifications.",
    "baggage": " All ZED ticket holders are afforded a baggage allowance of one piece per traveler. Each piece must weigh less than 50 pounds (23 kilos), and be smaller than 60 linear inches. Items that are over-size or over-weight will have standard baggage fees applied for acceptance.",
    "dress code": " Acceptable: Attire which is clean, well maintained and in good taste. Shirts with sleeves and collars, skirts, dresses, dress shoes. Not Acceptable: Attire that is torn, ragged, slashed, dirty, frayed, low cut, skimpy, or revealing. Attire with offensive or sexually oriented inscriptions or messages, halter/tube/midriff tops, sweats of any kind, leggings, beach or swim wear, body piercing, tattoos (cover from view), sport shoes and shoes that are dirty, stained, or worn in appearance.",
    "refunds": " To refund a ticket, cancel the itinerary and then retrieve the ticket number and select 'refund'. To verify the refund status or assistance regarding refunds, please contact reembolsosavta@avianca.com reembolsosavta@avianca.com",
    "special": " Special meals requests are not permitted for pass travelers.",
    "infants": " Children under 16 years cannot travel alone; they must be accompanied by an adult travelling on the same type of ticket.",
    "refunds email": " reembolsosavta@avianca.com",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Avianca Costa Rica staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Avianca Ecuador Notes",
    "url": "https://stafftraveler.com/en/notes/GLG",
    "general": " All changes, cancellations and refund requests should be made via myIDTravel. It is VERY IMPORTANT that you retrieve your PNR in myIDTravel upon receipt of this email and write your e-ticket numbers. Avianca Reservations and Airport agents have very limited access to assist with listing modifications.",
    "baggage": " All ZED ticket holders are afforded a baggage allowance of one piece per traveler. Each piece must weigh less than 50 pounds (23 kilos), and be smaller than 60 linear inches. Items that are over-size or over-weight will have standard baggage fees applied for acceptance.",
    "dress code": " Acceptable: Attire which is clean, well maintained and in good taste. Shirts with sleeves and collars, skirts, dresses, dress shoes. Not Acceptable: Attire that is torn, ragged, slashed, dirty, frayed, low cut, skimpy, or revealing. Attire with offensive or sexually oriented inscriptions or messages, halter/tube/midriff tops, sweats of any kind, leggings, beach or swim wear, body piercing, tattoos (cover from view), sport shoes and shoes that are dirty, stained, or worn in appearance.",
    "refunds": " To refund a ticket, cancel the itinerary and then retrieve the ticket number and select 'refund'. To verify the refund status or assistance regarding refunds, please contact reembolsosavta@avianca.com. reembolsosavta@avianca.com",
    "special": " Special meals requests are not permitted for pass travelers.",
    "infants": " Children under 16 years cannot travel alone; they must be accompanied by an adult travelling on the same type of ticket.",
    "refunds email": " reembolsosavta@avianca.com",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Avianca Ecuador staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Avianca El Salvador Notes",
    "url": "https://stafftraveler.com/en/notes/TAI",
    "important": " Loads will not be available until 72 hours prior departure of the flight. Your request will be answered 48 - 72 hours before your flight.",
    "general": " All changes, cancellations and refund requests should be made via myIDTravel. It is VERY IMPORTANT that you retrieve your PNR in myIDTravel upon receipt of this email and write down your e-ticket numbers. Avianca Reservations and Airport agents have very limited access to assist with listing modifications.",
    "baggage": " All ZED ticket holders are afforded a baggage allowance of one piece per traveler. Each piece must weigh less than 50 pounds (23 kilos), and be smaller than 60 linear inches. Items that are over-size or over-weight will have standard baggage fees applied for acceptance.",
    "dress code": " Acceptable: Attire which is clean, well maintained and in good taste. Shirts with sleeves and collars, skirts, dresses, dress shoes. Not Acceptable: Attire that is torn, ragged, slashed, dirty, frayed, low cut, skimpy, or revealing. Attire with offensive or sexually oriented inscriptions or messages, halter/tube/midriff tops, sweats of any kind, leggings, beach or swim wear, body piercing, tattoos (cover from view), sport shoes and shoes that are dirty, stained, or worn in appearance.",
    "refunds": " To refund a ticket, cancel the itinerary and then retrieve the ticket number and select 'refund'. To verify the refund status or assistance regarding refunds, please contact reembolsosavta@avianca.com reembolsosavta@avianca.com",
    "special": " Special meals requests are not permitted for pass travelers.",
    "infants": " Children under 16 years cannot travel alone; they must be accompanied by an adult travelling on the same type of ticket.",
    "refunds email": " reembolsosavta@avianca.com",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Avianca El Salvador staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Avianca Peru Notes",
    "url": "https://stafftraveler.com/en/notes/TPU",
    "general": " All changes, cancellations and refund requests should be made via myIDTravel. It is VERY IMPORTANT that you retrieve your PNR in myIDTravel upon receipt of this email and write down your e-ticket numbers. Avianca Reservations and Airport agents have very limited access to assist with listing modifications.",
    "baggage": " All ZED ticket holders are afforded a baggage allowance of one piece per traveler. Each piece must weigh less than 50 pounds (23 kilos), and be smaller than 60 linear inches. Items that are over-size or over-weight will have standard baggage fees applied for acceptance.",
    "dress code": " Acceptable: Attire which is clean, well maintained and in good taste. Shirts with sleeves and collars, skirts, dresses, dress shoes. Not Acceptable: Attire that is torn, ragged, slashed, dirty, frayed, low cut, skimpy, or revealing. Attire with offensive or sexually oriented inscriptions or messages, halter/tube/midriff tops, sweats of any kind, leggings, beach or swim wear, body piercing, tattoos (cover from view), sport shoes and shoes that are dirty, stained, or worn in appearance.",
    "refunds": " To refund a ticket, cancel the itinerary and then retrieve the ticket number and select 'refund'. To verify the refund status or assistance regarding refunds, please contact reembolsosavta@avianca.com reembolsosavta@avianca.com",
    "special": " Special meals requests are not permitted for pass travelers.",
    "infants": " Children under 16 years cannot travel alone; they must be accompanied by an adult travelling on the same type of ticket.",
    "refunds email": " reembolsosavta@avianca.com",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Avianca Peru staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Azores Airlines Notes",
    "url": "https://stafftraveler.com/en/notes/RZO",
    "general": " S4 flies international / SP flies inter island",
    "baggage": " 1 piece with a max of 23kgs + 8kg carry on luggage",
    "dress code": " Casual",
    "listing": " 1. Seniority (retired staff) 2. Seniority (active Staff) 3. Family Members 4. OA, myIDtravel, ZED, etc. 1. 2. 3. 4.",
    "check-in": " Because it is a small airline, non-rev passengers should always contact check in, tell which airline they work for and what they do.",
    "boarding": " With SBY BP wait till you're the last one. If already Accepted board normally.",
    "upgrade": " Non rev are not upgraded on S4. SP has only one class.",
    "refunds": " Should be done through myIDtravel",
    "website": " www.azoresairlines.pt",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Azores Airlines staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Azul Notes",
    "url": "https://stafftraveler.com/en/notes/AZU",
    "general": " Once your standby ticket has been issued, you can use your PNR on https://concessao-consulteseuvoo.voeazul.com.br/ to check your place and priority on the standby list.",
    "dress code": " Azul will not accept standby passengers if wearing: For Men: Slippers, shorts, ripped jeans, dirty shoes or clothes, swimsuits and any other attire considered indecent that might tarnish the image of the company. For Women: Slippers, shorts, ripped jeans, dirty shoes or clothes, swimsuits, mini skirt, mini blouse, low neckline, and any other attire considered indecent that might tarnish the image of the company.",
    "listing": " Listing is automatically created when purchasing your e-ticket through myIDTravel.com. So, when the payment is validated, you will automatically receive an itinerary receipt by email. Azul is a ticketless airline, so no e-ticket number will be generated only the PNR code. myIDTravel.com",
    "check-in": " Please check-in at voeazul.com.br/en/home within 48hrs of your flight. It is important to remember that the priority at Azul is always defined by booking date and NOT by check-in time. voeazul.com.br/en/home",
    "refunds": " Please be aware that Azul is a ticketless company, so you won't have a ticket number in order to ask for the refund. Therefore, all you have to do is retrieve the PNR through myIDTravel and cancel it, the refund will be processed automatically by Azul. The refund process may take until 10 business days. If you have any doubts, please send an e-mail to myidtravel@voeazul.com.br. myidtravel@voeazul.com.br",
    "general phone number": " +55 11 4003 3255",
    "email info": " myidtravel@voeazul.com.br",
    "refunds email": " myidtravel@voeazul.com.br",
    "website": " www.voeazul.com.br/",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Azul staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Bangkok Airways Notes",
    "url": "https://stafftraveler.com/en/notes/BKP",
    "website": " www.bangkokair.com/",
    "email domain": " bangkokair.com",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Bangkok Airways staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Belavia Notes",
    "url": "https://stafftraveler.com/en/notes/BRU",
    "baggage": " 20 kg economy",
    "listing": " Listing is required via e-mail space.control@belavia.by space.control@belavia.by",
    "email info": " space.control@belavia.by",
    "refunds email": " space.control@belavia.by",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Belavia staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Binter Canarias Notes",
    "url": "https://stafftraveler.com/en/notes/IBB",
    "email domain": " bintercanarias.com",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Binter Canarias staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Breeze Airways Notes",
    "url": "https://stafftraveler.com/en/notes/MXY",
    "important": " The company does not provide information on who is listed on standby. ・ There is an embargo for all non-rev travel on August 12th 2025 for a system upgrade.",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Breeze Airways staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "British Airways Notes",
    "url": "https://stafftraveler.com/en/notes/BAW",
    "important": " BA staff travel loads are not always accurate and should be taken as an 'approximate' guide to availability. It shows the number of listings and priority, but not commercial overbookings, etc. There are also examples where more available seats are shown than the cabin capacity, particularly in J class, due to moveable cabin dividers. Loads become available 72hrs before the departure of the flight.",
    "non-rev policy": " Heathrow Airport: Staff travel is behind zone G (Location is moved periodically) Steps: Check in at self service kiosk, if you get a seat, go to self service bag drop. If you don't get a seat, check the standby boarding card - quite often you'll see a message saying \"proceed through security\", this means you can standby at the gate. Of the message isn't present, go to staff travel desk and seek further advice.",
    "baggage": " For details, please see: www.britishairways.com/travel/bagchk/ www.britishairways.com/travel/bagchk/ Checked baggage Checked baggage Please note that once you have made a listing on BA (see Flight Listing section above), you can go to ba.com and check the baggage allowance for your specific flight. It is essential to check that information, because that is the allowance which will apply, regardless of what may be on your ticket. ba.com No single bag or piece of baggage will be accepted if it weighs more than 23 kg/51 lbs, regardless of the allowance applicable to the flight on which you are traveling. If you have an item which exceeds that weight, you must re-pack into separate bags. If this results in you exceeding the baggage allowance, you must pay any applicable excess baggage charges. Duty travel checked baggage Duty travel checked baggage Your allowance will be in accordance with the type of ticket you are using. JIDxxS1 will mean you are eligible to the business class allowance. YIDxxS1 will mean you are eligible to the economy class allowance. Cabin baggage Cabin baggage One medium bag, maximum dimensions 56 x 45x 25 cm (22 x 17.5 x 9.85 ins), maximum weight 23 kg/51 lbs (but you must be able to lift it into the overhead locker yourself). plus; One laptop bag OR one briefcase OR one handbag",
    "dress code": " General General BA has a dress code which is applied to rebate passengers. Please ensure that your attire is appropriate for the cabin of eligibility. Seat allocation will depend on how you present yourself. If your attire is inappropriate for the cabin of eligibility, you will be seated in a lower cabin, or may be refused travel. If there is a need on the day to upgrade on departure to a cabin higher than your cabin of eligibility, those who do not comply with the dress code applicable to the available cabin will not be considered for an upgrade. Club World and Club Europe cabins Club World and Club Europe cabins Employees should dress in a smart casual style which may include smart, clean jeans and training shoes. All cabins All cabins In any cabin, for comfort on long-haul overnight flights, employees may change into a plain-colored track (running) suit after take off. Any items of sports or beach wear or any other extremes of leisure wear are unacceptable in any cabin. Smart national dress or company uniform is acceptable in all cabins.",
    "listing": " Listing is required for all flights. Passengers without a listing will be refused travel. Important Note Important Note Please note that BA will not accept coupons for different airport pairs. The airport pair on your coupon must match the flight on which you wish to travel. For travel on flights operated by BA, BA CityFlyer, OpenSkies and the BA Franchisees (Sun-Air and Comair), listings must be made via idtravel.ba.com idtravel.ba.com Our listing site is not currently able to process tickets that feature other airlines and routes that are not specific to BA. Please be sure to complete the Flight Choices section on the web-site: this gives our check-in system information to help us allocate seats, for example, whether you are prepared to split across cabins or across flights if you are travelling with other people on the same ticket type. If you have any problems using the site, please check that your e-ticket has been correctly issued. If you are sure your e-ticket is correct, and are still having problems, please advise your staff travel office.",
    "check-in": " All airports with self-service check-in kiosks All airports with self-service check-in kiosks Additional information about Heathrow Terminal 5 You must be through the ticket presentation point by 35 minutes before scheduled flight departure time. This point is immediately before Security. You should only go to the Staff Travel area located behind Zone A in T5 if: Additional information about Heathrow Terminal 5 Additional information about Terminal 3 Staff passengers traveling to destinations from Terminal 3 will need to check-in at a check-in kiosk on arrival at the airport. There will be no staff travel office in Terminal 3. If a seat is allocated at the time of check-in, those passengers with hold baggage should proceed to a Fast Bag Drop desk to have their bags tagged. Passengers without bags should proceed to security. Passengers who are not allocated seats at the time of check-in should retain their bags and go the to Flight Management Desk. Passengers who are not accepted for their flight and who wish to standby for a later flight on the same day will be automatically transferred to the next flight. Alternatively, passengers will be able to re-list themselves at one of the Employee Self Service (ESS) kiosks available by the Customer Service Desk adjacent to the terminal entrance door. Additional information about Terminal 3 Changes to Terminal 3 check-in effective 17th September 2015 Check in at a kiosk in Zone D. If you are allocated a seat follow the kiosk instructions to have your bag tag(s) issued. You should then proceed to a bag drop desk. Note: there is no dedicated bag drop desk for staff passengers. If you are not allocated a seat at check-in proceed to the Staff Travel Room located to the right at the rear of the zone. You must check the screen in the office for further information. You may also receive a text message if you have registered your mobile/cell number. If accepted for travel go to a bag drop desk in the main area for your boarding card and baggage acceptance. If traveling with hand baggage only, proceed to the ESS Flight Management Desk to have your boarding card issued and documents checked. If you are not accepted for travel you will be automatically listed for the next flight to your destination if it is on the same day. You should return to the area to check the screens for acceptance. If you do not want to be listed for the next flight go to the ESS Flight Management Desk to advise. Changes to Terminal 3 check-in effective 17th September 2015 At London Gatwick North Terminal All staff travel colleagues who are not assigned a seat when checking in at a self-service kiosk will remain on standby landside until the flight has closed. Staff travel colleagues will then be on-loaded via a dedicated Flight Management Desk in Zone A At London Gatwick North Terminal All other airports: If there is a desk signposted for standby travel, go to that desk. If there is no signposted standby desk, go to the World Traveler or Euro Traveler desk. All other airports: Duty travel check-in Where kiosks don't exist check in at the counter for the class to which you are eligible, which will depend on whether you have JIDxxS1 - meaning business class, or YIDxxS1 - meaning economy. Duty travel check-in Check-in times To allow for the added security procedures now in place, please ensure that you have completed check-in formalities by 60 minutes before scheduled departure time . Check-in times Through check-in Through check-in is not available to standby passengers. When planning your trip, please ensure you leave yourself enough time to land and check-in again at any intermediate point. Through check-in",
    "boarding": " Once you are waiting for your flight at LHR, you can enter your PNR code at www.britishairways.com/onload on your phone. This will give you your flight status. Refreshed every minute. www.britishairways.com/onload When there are two or more interline employees travelling on the same flight, the time of check-in at the station where you are boarding your flight will determine the onload/offload and the cabin upgrade/downgrade order.",
    "upgrade": " Please do not ask any BA staff for an upgrade. If on the day of travel seats are not available in your cabin of eligibility, you will automatically be considered for an upgrade to the next higher cabin depending on commercial and operational needs, and subject to complying with the applicable dress code for that higher cabin.",
    "special": " Special meals Special meals It is not possible to pre-book special meals for rebate passengers. Therefore you and/or your eligible nominees who for any reason require a special diet, must provide your own food, in sufficient quantities to last for the duration of the flight. Seat requests Seat requests Unaccompanied minors Unaccompanied minors Children under 16 years cannot travel on a rebate ticket unless accompanied by an adult travelling on the same type of rebate ticket. Other Other No special service requirement is permitted when travelling on standby travel. Amenity bags will not be given to staff who travel in premium cabins. If offered, we ask that you politely decline.",
    "visa": " Please remember that for international travel, each passenger must have a valid passport, and must have relevant visas for the destination, and for scheduled points en route, in case off-loading becomes necessary. Also, some countries require Advance Passenger Information (API), and BA requires that this must be provided before check-in, using the Manage My Booking section of ba.com. ba.com USA: (Secure Flight data item added 18AUG10) Please note that with immediate effect, our listing website will collect the following data items for all travel to or from the USA before the listing is created: Gender, First name (as on passport), Last name (as on passport), Date of birth. This information is sent to the USA authority 72 hours before departure, or at the time of listing if that is within 72 hours. In addition to API, the USA requires all Visa Waiver passengers to have completed the Electronic System for Travel Authorization (ESTA) application, ideally at least 72 hours before departure. You do not need to enter travel details or address in the USA, and if approved, the authorization is valid for two years, so it is worth applying well in advance if you think you have any intention of travelling to the USA in the coming two years. If you do not have the authorization, you will not be able to travel on BA to the USA. The link to the web-site, which does show who is included in the Visa Waiver program, is: https://esta.cbp.dhs.gov https://esta.cbp.dhs.gov",
    "website": " www.britishairways.com",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your British Airways staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Brussels Airlines Notes",
    "url": "https://stafftraveler.com/en/notes/BEL",
    "website": " www.brusselsairlines.com/",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Brussels Airlines staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Canadian North Notes",
    "url": "https://stafftraveler.com/en/notes/AKT",
    "general": " E-tickets required for all passengers, excluding infants (see below for instructions regarding infants). All tickets issued as e-tickets and valid for 90 days from date of issue. Listing is mandatory and done at time of listing creation. Upon payment confirmation, e-ticket number and itinerary reference provided and itinerary/receipt is sent via email. E-ticket number(s) and itinerary reference(s) required for changes, refunds and check-in, reference Travel History for past numbers/itineraries.",
    "baggage": " Canadian North is required to enforce carry-on baggage size restrictions, as per Transport Canada regulations. A cabin baggage size unit is available at check-in to ensure that your carry-on(s) fit in the allotted space: Total space per passenger is two pieces not to exceed 22.86 cm x 40.64 cm x 57.15 cm (9\" x 16\" x 22.5\") each. Passengers are allowed to check two pieces of baggage at a maximum of 70 lbs (37.75 kgs) per piece on jet flights and 50 lbs (22.68 kgs) on prop flights. Exception - pax transitioning from jet to prop flight, or prop to jet flight permitted to check-in 70 lbs (37.75 kgs). Employees, their spouses, dependents and parents (S2, S3 and S4) may check-in one additional piece of luggage free of charge. Excess baggage charges will be assessed at the normal excess baggage rate without reduction. Carry-on baggage rules also apply to pass travelers. Maximum size is 62\" (159 cm) each (the sum of the height, width and depth). Employees must supply their own kennels for live animals and pets. Employees are exempt from excess baggage charges for the carriage of pets. Employees are subject to the same carriage rules as revenue passengers, refer to procedures for traveling with animals on the Company website. All checked baggage must have identification on the outside. A duplicate ID tag is also recommended for the inside of each checked piece of luggage. Claims for damaged, delayed or lost baggage will be processed in the same manner as regular fare paying passengers. Travel pass holders should be aware that at times their baggage may be loaded only if space permits and may not necessarily be loaded on the same flight. Pass travelers should avoid the use of overhead bins, leaving them free for revenue customers. Carry-on baggage should be of a size that permits under seat stowage.",
    "dress code": " Neat, clean, well-groomed and conservative appearance required. In recognition of the extreme winter conditions in the north, boots which are clean and in good condition are permitted. Unacceptable: ultra-casual clothing and footwear which is not in good taste, such as beach, sport, torn, dirty, offensive and/or overly revealing attire. Children (under 12) should be well groomed and well dressed in clothing suitable for travel.",
    "check-in": " 60 minutes prior to scheduled departure time.",
    "refunds": " Refund requests for wholly unused e-tickets processed automatically. Partially used e-tickets processed manually and can take several months. E-tickets eligible for refund up to one year from date of issue. Fare refunded to cc used to purchase ticket.",
    "infants": " Lap held infants do not require an e-ticket. To add infant to your itinerary, email reservations@canadiannorth.com at least 5 days prior to travel date with the following information: reservations@canadiannorth.com 5T Record Locator (itinerary reference) 5T e-ticket number Infant's full proper name Infant's date of birth (i.e. 01Jan2018) Updated itinerary will be emailed back to traveler. If within five dates of travel, do NOT contact Call Centre by email or phone, instead, plan to arrive at check-in several minutes early and check-in agent will add infant to itinerary.",
    "email info": " interline@canadiannorth.com",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Canadian North staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Cape Air Notes",
    "url": "https://stafftraveler.com/en/notes/KAP",
    "general": " Flight Listings on Cape Air may be made by calling Reservations at 866-CAPEAIR. For IET partners, please provide your e-ticket number.",
    "baggage": " 1 checked bag- maximum 50 lbs/62 linear inches",
    "dress code": " Resort Casual-jeans and sneakers are permitted",
    "general phone number": " 866-CAPEAIR",
    "listing phone number": " 866-CAPEAIR",
    "website": " www.capeair.com",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Cape Air staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Cathay Dragon Notes",
    "url": "https://stafftraveler.com/en/notes/HDA",
    "website": " www.cathaypacific.com",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Cathay Dragon staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Cathay Pacific Notes",
    "url": "https://stafftraveler.com/en/notes/CPA",
    "important": " Loads are capped at 10 for Business and Premium Economy Classes, and 40 for Economy Class",
    "general": " Cathay Pacific subtracts confirmed non-rev passengers from available seats. The displayed non-rev passenger count represents only those not yet accepted.",
    "baggage": " Checked Baggage Allowance for all ID passengers travelling with ID tickets shall be either 1 piece on services where the piece system applies or 40KG on all other services.",
    "dress code": " ID passengers should be dressed in accordance with public standards of good taste. This will normally mean attire suitable for an office, or smart casual wear. It excludes jeans, T-shirts, sweat-shirts, shorts, gym shoes, and similar extremes of casual wear. Dress standards are enforced at airports and our Airport Services staff have the final say on what is or is not acceptable dress and if the standard of dress is improper the ID passenger will not be accepted for boarding.",
    "listing": " If your airline has a Staff Travel Interline Electronic Ticket Agreement (STIET)with CX, you MUST arrange listing by visiting this website www.myidtravel.com/myidlisting/ and please show up at the respective CX airport services counter no later than 60 minutes before the scheduled flight departure. www.myidtravel.com/myidlisting/ You have purchased tickets via myIDTravel for CX, your listing has been arranged online at the time of ticketing. If you do not have your airline's log-in to access myIDTravel for CX, please contact your carrier's staff travel coordinator. If you are holding a Traditional Paper Ticket for CX, listing is not required and please show up and register at the respective airport services counter 120 minutes prior to scheduled flight departure. Please be reminded that Traditional Paper Tickets will remain in use where a specific bilateral arrangement exists between CX/KA and the carrier(s) concerned. If you are listed and your travel plan is changed, please cancel any unwanted listing via myIDTravel for CX at the earliest possible date in order to avoid wastage of meals and any additional costs for the transporting airlines.",
    "check-in": " All passengers, including non-revs, must check in online before their flight. Airport check-in will only be available if there are issues with online check-in. In case of issues with online check-in: The Standby counter is on the far end at counter A at Hong Kong International Airport. If you are holding Staff Interline Electronic Ticket and listed on any CX flight via www.myidtravel.com/myidlisting/, please show up at CX airport services counter no later than 60 minutes before the scheduled flight departure. www.myidtravel.com/myidlisting/ If you are holding a Traditional Paper Ticket for CX, listing is not required and please show up at airport services counter 120 minutes prior to scheduled flight departure.",
    "boarding": " ID passengers who have been accepted for boarding should arrive at the boarding gate at least 20 minutes before flight departure.",
    "upgrade": " ID passengers are not allowed to request upgrading. No upgrades will be granted.",
    "refunds": " Please submit refund application in myIDTravel. The refunds are processed manually by CX Refund Team and will be made within 14 business days from the date of refund application. Any refund requests must be made within 365 days from the ticket issue date. If you need further assistance, please contact GGTRefund.Group@cathaypacific.com GGTRefund.Group@cathaypacific.com",
    "special": " Flight range between CX1000-1999, 6000-7999 and 9000-9999.",
    "excluded flights": " Flight range between CX1000-1999, 6000-7999 and 9000-9999.",
    "visa": " Passengers must possess valid tickets and proper travel documents (including valid visas / entry permit if required) for all countries to or via which they travel, unless an exemption to that effect is granted by the country authorities. Passport must be valid for at least 6 months, while travel visa and/or entry permit must be valid for the period of stay or beyond depending on the country concerned. Failure to comply with the standard requirement may result in problems with passenger processing and refusal for entry.",
    "email info": " staff_travel@cathaypacific.com",
    "refunds email": " ggtrefund.group@cathaypacific.com",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Cathay Pacific staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Central Mountain Air Notes",
    "url": "https://stafftraveler.com/en/notes/GLR",
    "general": " Please call Central Mountain Air Reservations at +1 888 865 8585 to list for flights. Please have your ticket number, employee number and date of join. +1 888 865 8585",
    "baggage": " Central Mountain Air personnel will inspect baggage at Check-in. Only suitably packed pieces will be accepted for loading and is at the CMA agent's discretion. If necessary a signed release may be required. Each fare paying passenger can check 2 pieces of baggage and 1 carry-on piece of baggage without excess baggage charges. The maximum combined weight of all checked baggage is 50 lbs (23kg). The overall measurement of each piece of checked baggage (L + W + H) must be less than 62\" or 158 cm with a maximum weight up to 50 lbs (23kg) The carry-on piece must not exceed 9\" x 16\" x 22\" or 22 lbs. Central Mountain Air's route network covers a wide variety of communities, some with limited scheduled service. Some stage lengths are long and aircraft may have limited baggage/cargo capacity. While we try to accommodate both pieces of your free baggage allowance on the flight with you, you may be asked by the airport agent to prioritize one bag. We would request you prepack a priority piece with your most essential items. Excess baggage will be assessed at an additional charge. Excess baggage will only travel subject to space availability. Baggage may be tagged to Central Mountain Air destinations only. For other destinations passengers may be required to collect their baggage and re-check it for the connecting flight. Passengers should inspect their baggage at pickup. Should a passenger discover damage to their baggage they should notify Central Mountain Air personnel within 1 hour of its arrival. Despite care in the handling of your baggage, we trust you will understand that we are not responsible for the following: nicks, scratches, missing pull-straps, zipper damage, scuff marks, damage to wheels, soiling, manufacturing defects and damage resulting from over-packing or spillage of packed items.",
    "dress code": " This dress code applies to any person travelling under the Central Mountain Air employee travel program. Employees, retirees, their dependents, parents and partners are expected to always act with decorum and their personal appearance should be neat, clean and well groomed. Attire should be in good taste, not provocative or revealing. The following will not be tolerated: Airport will have the final decision where the dress code is not adhered to or is questionable. Examples of Unacceptable Attire: Children (under 12 years of age) We recognize that children's and young teenagers' clothing is of a more casual nature. Provided they are clean, neat and in good condition, shorts, t-shirts and other more casual clothing and footwear are permitted. When in doubt, dress up!",
    "check-in": " 1.5 Hours prior to flight time",
    "excluded flights": " Codeshare flights",
    "general phone number": " +1 888 865 8585",
    "listing phone number": " +1 888 865 8585",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Central Mountain Air staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "China Airlines Notes",
    "url": "https://stafftraveler.com/en/notes/CAL",
    "important": " For CI loads, pre-looking only allow within 60 days, over that limits , no data provided.",
    "listing": " Flight listing must be made 6 hours before departure with China Airlines worldwide reservations. For access to the reservation offices, you can refer to website www.china-airlines.com. www.china-airlines.com",
    "upgrade": " China Airlines will not upgrade staff from other airlines.",
    "website": " www.china-airlines.com/",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your China Airlines staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "China Eastern Airlines Notes",
    "url": "https://stafftraveler.com/en/notes/CES",
    "general": " Listing is not compulsory for MU staffs, therefore the company does not provide the data for the number of non-rev passengers.",
    "baggage": " Standard commercial baggage allowance applied to all non-rev staff passengers. Domestic flight with a connecting international flight under the same PNR will be awarded the same baggage allowance as the international flight.",
    "check-in": " Check-in must be made at the airport counter in-person and online check-in is not available for interline travellers. Non-rev passengers will be able to check-in at the airport 4 hours for international, and 2 hours for domestic flights prior to the scheduled departure time. However, if the flight is nearly full, non-rev passengers needs to wait until the commercial check-in closes before they can get a seat assigned.",
    "upgrade": " Only MU staffs are allowed to upgrade to business or premium economy class for a charge. The upgrade request and payment must be made through the Ceair mobile app.",
    "website": " www.ceair.com",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your China Eastern Airlines staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "CityJet Notes",
    "url": "https://stafftraveler.com/en/notes/BCY",
    "website": " www.cityjet.com/",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your CityJet staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Condor Notes",
    "url": "https://stafftraveler.com/en/notes/CFG",
    "important": " Currently, Condor crews cannot access load information.",
    "general": " Staff cannot see your boarding priority in our system. Condor staff boards first, and then it is determined by seniority.",
    "listing": " The listing may take approximately 6 to 12 hours to appear in the system and therefore will not be visible immediately.",
    "upgrade": " Condor does not upgrade full-fare pax to make room for standby pax If the cabin you are booked in is full, Condor will not upgrade you to the next higher booking class.",
    "excluded flights": " Condor flights which start with a \"3\", for example DE3114 or DE3115 (it has to be a four digit number) are charter flights and cannot be answered.",
    "website": " www.condor.com",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Condor staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Copa Airlines Notes",
    "url": "https://stafftraveler.com/en/notes/CMP",
    "baggage": " Copa Airlines allows two (2) free checked baggage of 23Kg each one per ticketed Staff. Please note that this is a special allowance available for CM employees and all ZED Staff. Size and weight limitations apply. All applicable excess, overweight, oversized checked baggage fees apply, consistent with revenue customer charges. Maximum weight is 23Kg (50 pounds) per bag and maximum size is 62 inches (length + width + height) per checked luggage. No Star Alliance Gold allowance is accepted if flying on ZED ticket.",
    "dress code": " All Staff/ZED travelers are required to dress appropriately and take care of their appearance. This requires neat casual attire and excludes track/sweat suits, tank tops, flip-flops, shorts and torn and/or extravagant clothing. Neat and tidy jeans are accepted. Staff/ZED travelers are not allowed to travel in airline uniform on Copa Airlines. Failure to observe this dress code may result in the refusal to accept the individual for travel.",
    "listing": " Listing is mandatory on CM flights. Listing is automatically created when purchasing your e-ticket on MyIDTravel.",
    "check-in": " Check-In will be available at copa.com 24 hours prior to departure time and until 1 hour. Please note that seats will not be assigned during check-in window. Boarding passes will be issued with SBY (Stand-By) seat. The Stand-by list will be cleared at the gate 45 minutes before departure. Seat change can be done at the gate after seat is assigned. Premium seats (rows 5 & 6) could also be assigned for all ZED if seat is available.",
    "boarding": " Seats will only be assigned at the gate, 45-50 minutes prior to departure. CM has a broad code listing, where CM staff will have a higher priority over other airline staff holding ZED tickets. ALL ZED Ticketed Staff from OAL will have the same listing code (S04Y). If several OAL Staff are found in one flight, priority will be based on check-in time.",
    "upgrade": " CM Staff is upgraded to Business cabin based on company’s priority coding and OAL ZED travelers are not upgraded. Please note that if there are only Business Class seats available, and no ConnectMiles PreferMembers listed for Business Class, CM will not upgrade Economy passengers to release seats for Staff Travelers. Crew rest seats are not available.",
    "included flights": " All Copa Airlines and Copa Airlines Colombia flights are included for ZED travelers.",
    "website": " www.copaair.com",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Copa Airlines staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Delta Air Lines Notes",
    "url": "https://stafftraveler.com/en/notes/DAL",
    "important": " Due to the large volume of Delta requests, it can take a while for your request to be answered. Most requests get answered on the day before departure. If your request has not been answered by the time the flight departs, your credit will automatically be refunded.",
    "non-rev policy": " Non-rev passengers are boarded as long as there are open seats.",
    "baggage": " No charge for 1st or 2nd bag unless oversize or overweight",
    "dress code": " Appropriate Appropriate Not appropriate Not appropriate",
    "listing": " Listing is mandatory on DL flights. Listing is automatically created when purchasing your eticket. If your original travel listing date has passed, you must access your ticket on myIDTravel and list again for your new travel date.",
    "check-in": " Check in online at delta.com within 24 hours of your flight or at an airport kiosk using your PNR (Delta Confirmation number). When travelling on a connecting flight, only check-in for your first segment. You will be automatically placed on the priority list for your connection when you are cleared in your origin city. Attempting to check-in for the connecting segment only will result in a lower boarding priority as you will not retain your original time stamp. delta.com If you list for more than one leg, the system will indicate a priority listing, this is false, you will only have a normal listing and is a system error.",
    "boarding": " OAL Non-rev passenger will not be cleared into First or Business class unless they are listed for that cabin.",
    "refunds": " Refund requests for wholly unused tickets will be processed automatically and the myIDTravel fee will be refunded. Refund requests for partially used tickets will be processed manually and may take some time. The myIDTravel fee is not refundable for partially used tickets. To retrieve your e-ticket for refunds please use only the first 13 digits on the ticket number.",
    "special": " SYD - LAX, ATL-JNB and ATL-CPT flights may be weight limited",
    "infants": " Infant/lap child ticket for international travel on DL cannot be processed at this time via myIDTravel. Please see a Delta agent at the airport. For travel within the U.S.A. an infant ticket is not required.",
    "included flights": " All flights operated by Delta Connection regional partners are included (Endeavor, Skywest, Republic)",
    "email info": " myidtravel.delta@delta.com",
    "refunds email": " myidtravel.delta@delta.com",
    "website": " www.delta.com",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Delta Air Lines staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "EasyJet Notes",
    "url": "https://stafftraveler.com/en/notes/EZY",
    "important": " EasyJet now sells 8 standby seats rather than the 2 they always used to cap it at.",
    "general": " Staff travel is a benefit that is given to all our staff; it gives them, and their friends and family, the opportunity to purchase seats at reduced cost, as well as taking advantage of discounted bags, sports equipment and flight changes. No “admin fees” are charged when you book via the staff travel website. Three fare types are available: Standard Fare : The normal fare but with the additional benefits listed above Staff Travel Confirmed : Confirmed seats at discounted prices with the additional benefits listed above Standby : Standby seats are available on approx. 92% of our routes. Standby is offered when a Confirmed Staff Travel seat is not available. 2 Standby's per flight maximum. To book, see under \"listing\"",
    "baggage": " With confirmed seats, hold luggage up to 23kg can be booked at discounted prices > Hold luggage cannot be booked on standby bookings, due to system limitations. Please remember this if you book a standby return ticket, and your outbound leg converts to a confirmed seat but the return leg does not > With effect from 10th February 2021 you will only be able to take on board one small cabin bag. Alternatively, you can book a hold bag for £5 each way via the staff travel website or by contacting customer services on the staff travel line. Failure to do so will incur a £48 charge at the gate > easyJet Plus members and FLEXI fare customers can bring their large cabin bag on board if they have booked an Upfront or Extra legroom seat or if they haven’t booked one of these seats, as long as there remains space. Customers buying Upfront and Extra legroom seats will continue to be able to take a small under seat cabin bag (45x36x20cm) plus a large overhead cabin bag (56x45x25cm) with them into the cabin. > The small under seat cabin bag allowance is (45x36x20cm) and must fit under the seat in front of you > If a standard confirmed seat is selected, you will be offered Hands Free for Free only when travelling with a staff member with staff ID. Stand-by customers can take their large cabin bag to the gate. It will get checked into the hold for free. As they are not yet guaranteed a seat, they cannot drop their bag at bag drop",
    "listing": " Where an easyJet employee adds you to their list of significant others, your name must match what it says on your passport > You can use https://stafftravel.easyJet.com to book flights; availability is the same as on www.easyJet.com > The employee will share their log in details, which you can use to book flights > You pay for the flights yourself – the easyJet employee doesn’t need to do that for you > If, after you have booked your flights, the employee removes you from their list of friends and family, or the employee leaves the business then don’t worry, your booking is still valid All major credit cards can be used for payment > No admin fees arise on bookings made using the staff travel website > Combinations of fare types are not permitted on the same booking > Where you book a standby fare, if a confirmed staff travel seat becomes available on that flight, then your standby booking is automatically converted to a confirmed seat. An email notification will be sent to let you know this has happened > Note that staff travel bookings cannot be made at either an airport Customer Service Desk; or through the contact centre, as our staff do not hold access to personal records and so cannot check eligibility",
    "website": " www.easyjet.com/en/",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your EasyJet staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Edelweiss Air Notes",
    "url": "https://stafftraveler.com/en/notes/EDW",
    "important": " Staff cannot see the availability of seats in Ymax (the economy with more legroom and free alcohol) until 2 days prior departure on any wide body flight.",
    "general": "",
    "upgrade": " Usually staff that is booked in Business will be downgraded to Y max by gate staff if no seat in C class can be assigned. Booked in Y class upgrade to Ymax can be on board at the Cabin Chiefs discretion. On board upgrade to Business Class on an non-rev Economy ticket is against policy",
    "email domain": " flyedelweiss.com",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Edelweiss Air staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "El Al Notes",
    "url": "https://stafftraveler.com/en/notes/ELY",
    "upgrade": " El Al does upgrade paying passengers to accommodate all non-rev travelers.",
    "website": " www.elal.com",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your El Al staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Emirates Notes",
    "url": "https://stafftraveler.com/en/notes/UAE",
    "important": " Loads generally become available 48 hours prior departure of the flight. Some EK members have earlier access to the flight loads.",
    "baggage": " Depends on the destination but for the most part 1 carry on bag with 1 personal item on board and 1 checked in luggage up to 20KG. Generally your bags will be booked through by EK to he end destination.",
    "dress code": " Business casual. No flip-flops, no shorts or mini skirts. No sleeves tops. Shoulders must be covered at all times. No sport attire.",
    "listing": " Emirates requires all standby passengers to have a listing prior to departure. Listings will not be handled by our Contact Centers nor at the Airport/check in desks, but will be actioned by our Interline Listing Application or myIDtravel - as per below conditions. isr.emirates.com ekidtravel@emirates.com To enable your listing we need the following details:",
    "check-in": " You can check in via the Emirates website, app, or at the airport check-in counter. In DXB, a designated area is available for staff check-in. Please use this area for seat assignment.",
    "upgrade": " Emirates will not upgrade non-revenue passengers. Normal policy is to upgrade revenue pax to make room for any staff.",
    "refunds": " Refunds will be permitted after 3 days and until 9 months from date of ticket issue. Beyond 9 months, refunds cannot be processed. Approximate processing time is 29 days. No correspondence will be entertained prior 29 days of refund request. Credit will be made only to the same credit card account used to purchase the ticket.",
    "special": " Special service requests Special service requests Not applicable for interline standby staff. Special meals Special meals Not applicable for interline standby staff. For firm bookable tickets, request your staff travel center to use applicable entries. Seat requests Seat requests Not applicable for interline standby staff. For firm bookable tickets, you may use 'Manage Booking' option via emiratesstaff.com. emiratesstaff.com Unaccompanied minors Unaccompanied minors Not applicable to interline staff. Unaccompanied dependents can only travel if they are over 16 years old.",
    "excluded flights": " EK Flight series 4000-7999 and 9000-9999.",
    "email info": " myidtravel@emirates.com",
    "refunds email": " stafftvlrefunds@emirates.com",
    "website": " www.emirates.com/",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Emirates staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Endeavor Air Notes",
    "url": "https://stafftraveler.com/en/notes/EDV",
    "website": " www.endeavorair.com/",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Endeavor Air staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Envoy Air Notes",
    "url": "https://stafftraveler.com/en/notes/ENY",
    "website": " www.envoyair.com/",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Envoy Air staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Etihad Airways Notes",
    "url": "https://stafftraveler.com/en/notes/ETD",
    "important": " Etihad staff receive detailed flight load, listing, and upgrade information approximately 72 hours before departure. Prior to this window, only estimated data is available. For flights beyond the 72-hour window, internal staff tools can provide estimated seat availability with a margin of error of approximately ±10%. These figures are unofficial and subject to change based on evolving booking patterns. Ultra long-haul routes, especially those to and from North America and Australia, are often subject to weight restrictions. These are typically applied manually by the operations team closer to departure. Unfortunately, staff and ZED travelers cannot determine in advance whether a flight will be weight-restricted, which may impact final seat availability. While the number of booked and checked-in passengers shown in the Etihad app is accurate, the seat capacity displayed may not reflect real-time changes. This may be due to weight restrictions, last-minute aircraft configuration changes, or blocked crew seats. More accurate capacity details may be available through internal crew or booking systems, but these often update more slowly than the app and may lag by several minutes or hours. Pending commercial upgrades, including those paid by cash or miles, are not visible to ZED or staff travelers. These upgrades may be processed at any time between 24 hours before departure and gate closure.",
    "general": " Etihad does not issue gate standby passes under current policy, primarily due to immigration handling in the UAE. At outstations where local immigration queues could cause delay and impact your ability to board, you may request an exception from the station manager. The manager, identified by their Etihad uniform, may grant an exception if local immigration procedures allow and if you are likely to be accepted on the flight. Once a ZED traveler is listed for a flight, real-time booking status, listing details, and upgrade lists become available via the Etihad app approximately 24 hours prior to departure. These can be accessed through the “Manage Flight” section of the app. If the information is not visible there, it may be accessed through the “Manage Booking” page on the Etihad website. Seat assignments for ZED standby travelers are handled automatically. This generally occurs around four hours before departure but may happen at any time between 24 hours before departure and check-in closure. Some bilateral agreements may permit earlier acceptance; travelers should refer to their company’s specific agreement with Etihad if applicable. The number of booked and checked-in passengers displayed in the Etihad app is reliable; however, seat capacity figures may not reflect last-minute adjustments due to operational changes. Internal systems may offer more precise capacity data, though these systems may lag behind the app in real-time accuracy.",
    "baggage": " As per etihadairways.com for the class you are eligible to travel in etihadairways.com The baggage allowance for non-revenue passengers is the same maximum that is provided to revenue passengers in their respective cabins. EY reserves the right to deny baggage allowance for non-revenue interline staff if the reciprocating airline has chosen not to provide baggage allowance to EY staff. For non-revenue staff travelers, if you are only transiting through Abu Dhabi, your baggage will be checked through to your final destination based on your original ticket. If you are denied boarding for your ticketed flight out of Abu Dhabi and need to alter your existing booking or make a new one, you may bring your baggage tag and ticket from your previous flight to the transit desk. The staff will provide instructions based on your specific circumstances and ticketing situation.",
    "dress code": " Business and Economy: Smart casual / UAE National dress. Smart jeans and trainers are acceptable. Not permitted: Dirty or torn clothing, beach or jogging clothes, flip flops, non-collared t-shirts, shorts, sleeveless tops. Clothing should not be transparent and shoulders should be covered. Low neckline and short skirts with a hem above the knee are not permitted.",
    "listing": " Listing is recommended for acceptance priority. Listing should be made through www.myidtravel.com/myidlisting. www.myidtravel.com/myidlisting Listing is recommended for acceptance priority but is not required. If you have booked your ticket through MyID, your listing is done automatically. If you booked through another portal, it is recommended that you use the following URL to list for a flight: www.myidtravel.com/myidlisting. Holding multiple listings for different flights on Etihad is acceptable; however, please do not check in for multiple flights simultaneously, as you may risk being accepted onto multiple flights. No-shows will be reported to your company for ticketing abuse. Please be aware that Etihad actively monitors and enforces policies against ticketing misuse and manipulation.",
    "check-in": " All standby ticket holders must check in using the Etihad Airways mobile app or www.etihad.com in order to be added to the waitlist. If you are accepted on a flight, you will be notified via the Etihad app and by email. If seats become available during the final moments of the check-in process, you will receive a last-minute acceptance notification through the same channels. In Abu Dhabi, accepted passengers should use the self-service baggage drop located at Row D in the check-in hall. At outstation airports, proceed to the check-in counter for the cabin you have been accepted in. If you encounter an error during online check-in, proceed to an Economy check-in desk to be added manually to the waitlist. You must be checked in no later than 60 minutes prior to departure, or 120 minutes if you are traveling to the United States.",
    "boarding": " For non-revenue staff, boarding is prioritized based on boarding priority, not ticket type. Staff with higher priority will board first, even with Economy Class tickets, before ticket holders with business or First Class upgradability, even when Economy Class is full. To accommodate, a revenue passenger may be upgraded. Once all Etihad staff, family, and friends are boarded, priority for other airline staff will be sorted by their respective join date with their airline.",
    "upgrade": " For standby business and first-class upgradability, your ticket will be issued in economy with a cabin upgrade code. You may choose to decline a seat in economy, but you must inform the check-in staff ahead of time. Otherwise, you will be assigned an economy seat if no other seats are available. Standby upgrades are subject to availability at flight closure. Airport staff and cabin crew are not permitted to accommodate guests in a higher class than ticketed. Access to business and first-class standby upgrades for staff is based on reciprocity agreements. The majority of EY's 200+ partners have access to standby business class bookings. However, if the option is unavailable in MyID, it means your airline has chosen not to reciprocate. Please contact your staff travel department to express interest in establishing a premium cabin reciprocity agreement with EY. Pending paid or mileage upgrades are not visible to ZED or staff travelers. These can be processed anytime between 24 hours before departure and gate closure.",
    "refunds": " Fully unused tickets will be processed automatically by myIDTravel system. For partial refunds please email myidtravel@etihad.ae. If you are downgraded from Business to Economy class please send copy of b/pass to myidtravel@etihad.ae for processing. Partial and Downgrade refunds are processed manually and may take some time. A ticket can be refunded within ticket validity, which is one year from date of issuance. myidtravel@etihad.ae myidtravel@etihad.ae",
    "special": " Wheelchairs Wheelchairs Wheelchair is acceptable but no other special requests can be accepted. Special meals Special meals Not applicable for standby staff. Seat requests Seat requests Not applicable for staff guests.",
    "infants": " Infant safety seats Not applicable to interline staff guests.",
    "excluded flights": " EY flights series 1000-8000",
    "visa": " API data is entered into PNRs to avoid last minute data-collection at check-in. Travelling staff/family should ensure that they hold valid passport and relevant visas for their intended destination and/or scheduled point en route, in case off-loading becomes necessary. In the absence of valid passport / visa staff passengers may be denied boarding.",
    "general phone number": " +971 2 511 2233",
    "email info": " myidtravel@etihad.ae",
    "refunds email": " myidtravel@etihad.ae",
    "website": " www.etihad.com/",
    "email domain": " etihad.ae",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Etihad Airways staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Eurowings Notes",
    "url": "https://stafftraveler.com/en/notes/EWG",
    "general": " Germanwings and Eurowings are ticketless airlines. This means that all you need for check-in is your booking confirmation (PNR), a valid identity document and the staff member id card.",
    "baggage": " One bag with 23 kg is free.",
    "check-in": " All 4U & EW legs are e-ticketed. Make sure to have Booking Reference for travel.",
    "refunds": " Refund requests for wholly unused tickets (no-show confirmed tickets will not be refunded) will be processed automatically and the myIDTravel fee will be refunded. Refund requests for partially used tickets will be processed manually and may take some more time. Mind the myIDTravel fee is not refundable on partially used tickets.",
    "excluded flights": " Please do not book smart-connect flights! We have problems with transporting your baggage to your destination.",
    "visa": " Starting from 24 hours before scheduled flight time we will not refund CONFIRMED TIX and in case of no-show we will not refund CONFIRMED TIX.",
    "email info": " reisestelle@eurowings.com",
    "website": " www.eurowings.com",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Eurowings staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "EVA Air Notes",
    "url": "https://stafftraveler.com/en/notes/EVA",
    "important": " Load information for EVA Air flights is only available up to 15 days in advance.",
    "upgrade": " EVA Air will not upgrade non-revenue staff from other airlines. EVA Air will not upgrade revenue passenger to make room for staff from other airlines.",
    "website": " www.evaair.com",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your EVA Air staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "ExpressJet Airlines Notes",
    "url": "https://stafftraveler.com/en/notes/ASQ",
    "website": " www.expressjet.com/",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your ExpressJet Airlines staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "FedEx Notes",
    "url": "https://stafftraveler.com/en/notes/FDX",
    "website": " www.fedex.com",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your FedEx staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Fiji Airways Notes",
    "url": "https://stafftraveler.com/en/notes/FJI",
    "website": " www.fijiairways.com/",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Fiji Airways staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Finnair Notes",
    "url": "https://stafftraveler.com/en/notes/FIN",
    "baggage": " Same baggage rules apply as for revenue passengers. Please see www.finnair.com for detailed information. www.finnair.com",
    "dress code": " General General All staff travelers must dress in good taste. A lack of such attire may cause a refusal of the access for a flight. Economy class Economy class Staff travelers must dress in smart/casual wear (presentable jeans accepted) and tidy footwear. Business class Business class In case of an upgrade situation, staff travelers considered for an upgrade must dress in smart wear (jeans are not accepted) and tidy footwear. All cabins All cabins The following attire will not be accepted on board: sportswear, shorts, beachwear or tracksuits and windcheaters.",
    "listing": " All flight listings should be made to https://www.myidtravel.com/myidlisting/. https://www.myidtravel.com/myidlisting/ Please note that listing is mandatory. Your listing may also be already created at the time of your ticket purchase, please check from your myIDTravel confirmation or e-ticket receipt. Your User ID and password for myIDTravel are based on your employing airline. Your user id is e.g. YYstaff (YY=your employing airline code) and your password the three digit code of your employing airline (e.g. 105). If you have problems logging in to myIDTravel , please contact your Staff Travel Dept. Please note that your ticket numbers should be available when creating a listing. Always have your e-ticket numbers available when traveling with Finnair.",
    "check-in": " Passengers travelling on staff tickets issued by Finnair through myIDTravel application (ticket number starts with numbers 105) shall check in online at Finnair internet pages (www.finnair.com - International Site - Check-in). The service is available 12 hours prior to the flight until the minimum check-in time. You may also check-in at the airport by using self-service check-in kiosks (if available). www.finnair.com For passenger travelling on staff tickets issued by their own employing airline (ticket number does not start with numbers 105) the online check-in services are not available and check-in shall be made at Economy class check-in desk. The check-in must be completed within the recommended check-in times which you may find at Finnair internet pages on each destinations own page (www.finnair.com - International site - Destinations). www.finnair.com Check-in times Check-in times The passenger must check-in within the recommended check-in times which can be found at www.finnair.com on each destinations own page. A delayed check-in may cause a refusal of the access for a flight. www.finnair.com Through check-in Through check-in Through check-in is not available to standby passengers. When planning your trip, please ensure that you leave yourself enough time at any intermediate point to land, clear any border authorities processes, collect your baggage, clear any customs formalities and check-in again.",
    "boarding": " Passengers are requested to move to the departure gate in the boarding time shown in the boarding pass at the latest. If the boarding pass shows a defined seat, the passenger can go straight to the plane. In case there is no seat assigned yet, the passenger should take the boarding pass to the gate officer and wait by the gate until the gate officer invites him/her to the plane. For security reasons the passenger must always travel on the same flight as his/her baggage has been checked-in. To avoid flight delays due baggage off-loading the passenger, including his/her travel party, may not refuse to board the aircraft after seats have been assigned to them. A refusal is accepted only in an emergency situation.",
    "upgrade": " Upgrade may be provided to staff travelers only in exceptional circumstances. Please don't ask AY staff for an upgrade.",
    "special": " Special mealsSpecial meals are not available to any standby passengers. If you have specific dietary needs or preferences, you should carry on board your own provisions. Special meals Seat requests Seat requests Advance reservation of a specific seat is not allowed by staff travelers. Infant safety seats Infant safety seats Infants safety seats are not provided to staff travelers. Unaccompanied minors Unaccompanied minors Children under 16 years of age may not travel on a stand-by ticket unless accompanied by an adult holding a similar discounted ticket.",
    "infants": "",
    "included flights": " Flights operated by AY",
    "excluded flights": " All flights not operated by Finnair. Flights operated by BE (former Flybe Finland - now Nordic Regional Airlines)",
    "embargoes": " HEL-BKK-HEL route with firm leisure travel tickets (IDZMR1/ID50R1).",
    "visa": " If travelling on flights with one or more stopovers, the holder of a reduced fare ticket may be requested to give his seat to a paying passenger. Therefore, he should have the necessary valid travel documents (passport, visa, vaccination) for every country where a stop over is foreseen. All fines imposed on the carrier following non-compliance to these rules will be charged back to the non-compliant staff member",
    "email info": " id-leisure@finnair.com",
    "refunds email": " id-leisure@finnair.com",
    "website": " www.finnair.com/",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Finnair staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Flair Airlines Notes",
    "url": "https://stafftraveler.com/en/notes/FLE",
    "important": " Passenger loads can only be provided within 72 hours of departure.",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Flair Airlines staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Flydubai Notes",
    "url": "https://stafftraveler.com/en/notes/FDB",
    "important": " Flydubai staff are able to see the loads for the flight 6-7 days before the departure. There is no point to post any later requests than that.",
    "website": " www.flydubai.com/",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Flydubai staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "French Bee Notes",
    "url": "https://stafftraveler.com/en/notes/FBU",
    "important": " French Bee doesn’t publish any loads until 48 hours prior departure of the flight.",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your French Bee staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Frontier Airlines Notes",
    "url": "https://stafftraveler.com/en/notes/FFT",
    "important": " The standby list F9 members can see at Frontier isn’t always complete. F9 employees can only see what ID90 shows them, since not all of them have access to the Navitaire system.",
    "dress code": " Business casual, no ripped jeans, no flip flops.",
    "check-in": " To view the checked-in standby list, go to https://f9standby.flyfrontier.com. If the booking is made as a jump seater, you will not be shown here as you can't check in via the app/online. However, if the booking is made as a ZED fare it will allow online check in and will show up here. The list also shows checked in F9 employees traveling. https://f9standby.flyfrontier.com You can check -in at the gate or through the app depending on the Agreement with each airline.",
    "upgrade": " No upgrades available",
    "website": " www.flyfrontier.com/",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Frontier Airlines staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Germanwings Notes",
    "url": "https://stafftraveler.com/en/notes/GWI",
    "general": " Germanwings and Eurowings are ticketless airlines. This means that all you need for check-in is your booking confirmation (PNR), a valid identity document and the staff member id card.",
    "baggage": " One bag with 23 kg is free. (SSR:BAG1)",
    "check-in": " All 4U & EW legs are e-ticketed. Make sure to have Booking Reference for travel.",
    "refunds": " Refund requests for wholly unused tickets (no-show confirmed tickets will not be refunded) will be processed automatically and the myIDTravel fee will be refunded. Refund requests for partially used tickets will be processed manually and may take some more time. Mind the myIDTravel fee is not refundable on partially used tickets.",
    "excluded flights": " Please do not book smart-connect flights! We have problems with transporting your baggage to your destination.",
    "visa": " Starting from 24 hours before scheduled flight time we will not refund CONFIRMED TIX and in case of no-show we will not refund CONFIRMED TIX.",
    "email info": " reisestelle@eurowings.com",
    "website": " www.germanwings.com",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Germanwings staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Gol Notes",
    "url": "https://stafftraveler.com/en/notes/GLO",
    "baggage": " Non-revs can check 1 piece of luggage (up to 23kg/50lb), free of charge.",
    "check-in": " At Guarulhos and Congonhas Airport, you may use the Beneficio Viagem counter to check in. Non-revs now can check-in online; Seats will be assigned at the gate.",
    "refunds email": " reembolso@voegol.com.br",
    "website": " www.voegol.com.br",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Gol staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Gulf Air Notes",
    "url": "https://stafftraveler.com/en/notes/GFA",
    "website": " www.gulfair.com/",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Gulf Air staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Hawaiian Airlines Notes",
    "url": "https://stafftraveler.com/en/notes/HAL",
    "important": " Seat availability information for Hawaiian Airlines is available 90 days prior departure of the flight (except in December it’s 30 days). Inter island flight loads can swing dramatically at the last minute, so be flexible. Platinum, gold, and corporate ticket holders can all standby for earlier flights free of charge, and sometimes many show up at the gate at the last moment which makes it hard to judge nonrev loads since they are seated before any standby passengers. Also, entire standby lists are transferred to the next inter island departure by gate agents as each flight closes, so sometimes the next flight can go from wide open to completely full in just a few minutes due to that process.",
    "website": " www.hawaiianairlines.com/",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Hawaiian Airlines staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Helvetic Airways Notes",
    "url": "https://stafftraveler.com/en/notes/OAW",
    "email domain": " helvetic.com",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Helvetic Airways staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "HK Express Notes",
    "url": "https://stafftraveler.com/en/notes/HKE",
    "website": " www.hkexpress.com",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your HK Express staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Hong Kong Airlines Notes",
    "url": "https://stafftraveler.com/en/notes/CRK",
    "website": " www.hongkongairlines.com/",
    "email domain": " hkairlines.com",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Hong Kong Airlines staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Horizon Air Notes",
    "url": "https://stafftraveler.com/en/notes/QXE",
    "baggage": " Non-revs get 2 free checked bags on all AS or QX flights. Also non-revs whose checked bags do not arrive will get free delivery.",
    "website": " www.alaskaair.com/",
    "email domain": " horizonair.com",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Horizon Air staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Iberia Notes",
    "url": "https://stafftraveler.com/en/notes/IBE",
    "important": " Flights between MAD and BCN don't need reservations. Loads are thus inaccurate. Iberia loads become available 72hrs prior to the departure of the flight.",
    "general": " Only ground staff have access to the number of non-rev passengers who have acquired a ticket for a specific flight. Other employees, including pilots and flight attendants, can access information about non-rev passengers 24 hours prior to the flight's departure. This coincides with the opening of online check-in for these passengers. Please note that employees can only see the number of standby passengers who have already checked in, not the total number of non-rev passengers who have purchased tickets for the flight.",
    "baggage": " No single bag or piece of baggage will be accepted if it weighs more than 23kgs/51lbs, regardless of the allowance applicable to the flight on which you are traveling. If you have an item which exceeds that weight, you must re-pack into separate bags. If this results in you exceeding the baggage allowance, you must pay any applicable excess baggage charges. It is possible to check in extra bags on your flight. However, the fare for extra bags might be higher than advertised on the website. When traveling with Iberia via Madrid (MAD), please be aware that your checked baggage might not be automatically transferred to your onward flight. To ensure a smooth connection, it’s advisable to schedule a layover that allows sufficient time to retrieve your baggage from the carousel, clear any necessary customs checks, and then re-check it for your final destination.",
    "dress code": " IB has a dress code which is applied to rebate passengers. Please ensure that your attire is appropriate for the cabin of eligibility. Seat allocation will depend on how you present yourself. If your attire is inappropriate for the cabin of eligibility, you will be seated in a lower cabin, or may be refused travel. If there is a need on the day to upgrade on departure to a cabin higher than your cabin of eligibility, those who do not comply with the dress code applicable to the available cabin will not be considered for an upgrade.",
    "listing": " Please note that IB will not accept coupons for different airport pairs. The airport pair on your coupon must match the flight on which you wish to travel. For travel on flights operated by IB, I2 and YW, listing it is not required.",
    "check-in": " All airports with self-service check-in kiosks: All airports with self-service check-in kiosks: Please present yourself at a self-service check-in kiosk at least 60 minutes before your scheduled flight departure. The kiosk will tell you what to do next, so please read the screen carefully. The kiosk will print a boarding pass, which will show your booking reference: this is key information, especially if you are not allocated a seat number by the kiosk. If the kiosk prints a boarding card with a seat number, this means you have been accepted for the flight; please go immediately to the departures lounge and the gate If the kiosk prints a boarding card without a seat number, the kiosk will tell you what to do next. Check-in times Check-in times To allow for the added security procedures now in place, please ensure that you have completed check-in formalities by 60 minutes before scheduled departure time Through check-in Through check-in Through check-in is not available to standby passengers. When planning your trip, please ensure you leave yourself enough time to land and check-in again at any intermediate point.",
    "boarding": " When there are two or more interline employees traveling on the same flight, the time of check-in at the station where you are boarding your flight will determine the onload/offload and the cabin upgrade/downgrade order.",
    "upgrade": " Please do not ask any IB staff for an upgrade. If on the day of travel seats are not available in your cabin of eligibility, you will automatically be considered for an upgrade to the next higher cabin depending on commercial and operational needs, and subject to complying with the applicable dress code for that higher cabin.",
    "refunds": " Period of refund: 4 months after validity date",
    "special": " Special meals Special meals Seat requests Seat requests Infant safety seats Infant safety seats Unaccompanied minors Unaccompanied minors",
    "visa": " Please remember that for international travel, each passenger must have a valid passport, and must have relevant visas for the destination, and for scheduled points en route, in case off-loading becomes necessary. Also, some countries require Advance Passenger Information (API), and requires that this must be provided before check-in, using to the USA. The link to the web-site, which does show who is included in the Visa Waiver programme, is: esta.cbp.dhs.gov esta.cbp.dhs.gov",
    "email info": " restkt@iberia.es",
    "refunds email": " empleados@iberia.com",
    "website": " www.iberia.com",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Iberia staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Icelandair Notes",
    "url": "https://stafftraveler.com/en/notes/ICE",
    "baggage": " 1 piece of checked in luggage with a max 23 KG (50 LBS), 1 cabin bag with a max 55 x 40 x 20cm (21.6 x 15.7 x 7.8in), and 1 personal item per staff member will be allowed. Additional checked pieces or an oversized carry on bag will be charged.",
    "dress code": " All staff travellers must dress in smart/neat clothes and tidy footwear. An employee who does not abide by these rules can by denied boarding. Passengers travelling on reduced rate fares are expected to show politeness and courtesy and use alcohol in moderation.",
    "listing": " Listing only via MYIDTravel",
    "check-in": " Check in must be completed either online or at the check in desk at the airport. Check in is not available for staff at the airport kiosks. If checking in at the airport check in desk, a seat may be given in advance if there are sufficient seats on the flight.",
    "refunds": " If in need of a refund, please contact refunds@icelandair.is",
    "website": " www.icelandair.com/",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Icelandair staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "IndiGo Notes",
    "url": "https://stafftraveler.com/en/notes/IGO",
    "important": " IndiGo may prepone flights by around 10 minutes, typically 2–3 days before departure. These changes only appear on IndiGo’s official website and via text messages—third-party apps and tracking websites do not reflect the updated time.",
    "general": " IndiGo has recently introduced a Business Class–equivalent product, which is not available to staff. The staff travel portal only shows:",
    "non-rev policy": " IndiGo employees can list with a PNR without payment, leading to a \"first come, first serve\" boarding policy rather than based on rank/seniority.",
    "listing": " Effective June 27, 2025, IndiGo staff (employees and nominees) must complete payment for SLT PNRs at least 24 hours before scheduled departure.",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your IndiGo staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Israir Notes",
    "url": "https://stafftraveler.com/en/notes/ISR",
    "general": " For Non-rev please use myIDTravel. For domestic flights, in case of confirmed seat, booking must be made up to 24 hours prior the flight.",
    "baggage": " 23 KG",
    "check-in": " To allow for the added security procedures now in place, please ensure that you have completed check-in formalities by 60 minutes before scheduled departure time. It is advised to arrive to the airport 150 minutes before scheduled departure time for international flights.",
    "boarding": " Employees of other airlines are accepted after 6H own employees and their eligibles have been checked-in. When there are more ID travelers on the same flight, the boarding priority criteria will be as follows:",
    "excluded flights": " All flights not operated by 6H",
    "visa": " Please remember that for international travel, each passenger must have a valid passport, and must have relevant visas for the destination.",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Israir staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "ITA Airways Notes",
    "url": "https://stafftraveler.com/en/notes/ITY",
    "listing": " Listing is mandatory on all Alitalia Flights",
    "upgrade": " For ZED-LOW fares - gate agents will auto-assign a seat in \"Back Seat\" class, if you would like a seat closer to the front (even in economy) you will need to pay at the gate to upgrade. You can NOT upgrade from economy to premium economy or business.",
    "refunds": " Refund will be made within two months after submission of request",
    "email info": " stafftktsupport@alitalia.it",
    "refunds email": " myidtravelrefund@alitalia.it",
    "website": " alitalia.com",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your ITA Airways staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Jazeera Airways Notes",
    "url": "https://stafftraveler.com/en/notes/JZR",
    "email domain": " jazeeraairways.com",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Jazeera Airways staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Jazz Notes",
    "url": "https://stafftraveler.com/en/notes/JZA",
    "website": " www.flyjazz.ca/",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Jazz staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Jet Airways (India) Notes",
    "url": "https://stafftraveler.com/en/notes/JAI",
    "general": " Kindly note that you will be required to carry a printout of your e-ticket to gain entry into any Indian airport and for check-in along with valid photo identification as mentioned in the itinerary.",
    "baggage": " As per www.jetairways.com for the class of travel you are ticketed in. www.jetairways.com",
    "dress code": " Economy Economy The minimum standard of dress is smart casual: Male: Collared shirt/Polo-shirt and smart casual trousers. Smart jeans and sport shoes may be worn. Female: Dress, trousers or skirt and top with sleeves/knee length skirt/ salwar kameez or sarees. Smart jeans and sport shoes may be worn. Children under 12: Smart casual. Smart jeans and sport shoes may be worn. Premiere Premiere The minimum standard of dress is : Male: Long sleeved jacket, collared shirt and smart trousers. A tie is not necessary.(Note: For upgrade to Premiere, Jeans are not permitted). Female: Long sleeved jacket, blouse/smart top with sleeves, knee length skirt, smart trousers, a dress/ salwar kameez or a saree. (Note: For upgrade to Premiere, Jeans are not permitted). Children under 12: Smart casual. Smart jeans and sport shoes may be worn. Certain clothing items are considered unacceptable for travel. These include worn-out/ distressed jeans, baggy jeans, dirty or torn clothes, beach or jogging attire as well as t-shirts, shorts, sleeveless tops, beach shoes and slippers. Skirts and dresses must not be shorter than knee length. Traditional attire is permissible for elderly parents. It is really important that you comply with the dress code otherwise you will be faced with the embarrassing situation of being asked to change. If you do not possess suitable alternative clothing you may not be able to travel. Please ensure you comply with passport and visa requirements for your transit/destination and travel and please co-operate with instructions given to you by the on-duty Jet Airways staff at check-in or onboard the aircraft. The staff travel ticket that is issued is a reduced rate of free ticket and it comes with responsibilities, to follow relevant procedures and guidelines. It is equally important that relatives travelling on such tickets are aware of these requirements and it is your responsibility to ensure they are fully briefed before their departure. We look forward to welcome you onboard.",
    "listing": " Listing is done on Jet Airways flights once ticket is issued via myIDTravel. If the ticket consist any 9W flight between 9W*7000-7999 series, manual listing is required. Manual listing can be done by calling Jet Airways contact center. Contact center communication details are available on www.jetairways.com. www.jetairways.com",
    "check-in": " Domestic check-In Domestic check-In Check-in usually starts 120 minutes before departure. Passengers are requested to report at least 60 minutes before scheduled time of departure to avoid inconvenience International check-In International check-In Check-in usually starts 180 minutes before departure. Passengers are requested to report at least three hours in advance before the scheduled departure to avoid inconvenience",
    "refunds": " Fully unused tickets will be processed automatically by myIDTravel system. For partial refunds please email interlineoal@jetairways.com & centralhelpdesk@jetairways.com. If you are downgraded from Business to Economy class please send copy of boarding pass to interlineoal@jetairways.com & centralhelpdesk@jetairways.com for processing. Partial and Downgrade refunds are processed manually and will take 3 weeks to process. A ticket can be refunded within one year from date of issuance. interlineoal@jetairways.com centralhelpdesk@jetairways.com interlineoal@jetairways.com centralhelpdesk@jetairways.com",
    "special": " Through-travel not available for standby passengers. When planning your trip, please ensure you leave yourself enough time to land and check-in again at any intermediate point.",
    "visa": " For international travel, each passenger must have a valid passport, and must have relevant visas for the destination, and for scheduled point's en-route, in case off-loading becomes necessary. Some countries require Advance Passenger Information System (APIS), and 9W requires that this must be provided before check-in.",
    "email info": " interlineoal@jetairways.com",
    "refunds email": " centralhelpdesk@jetairways.com",
    "website": " www.jetairways.com/",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Jet Airways (India) staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "JetBlue Notes",
    "url": "https://stafftraveler.com/en/notes/JBU",
    "general": " JetBlue doesn't go by seniority as some airlines do, we go by check-in time. So try to be the first to check in at the 24hr mark before scheduled departure, this will determine your priority level within your group. For reference: S2 Confirmed Crew S3 Super Pass Crew S4 Crew S5 Dependents S6 Buddy Pass S7 Other Airline Crew (Paying (myID Travel/Leisure) S8 Other Airline Crew (Free (Cabin Agreement/Commuting)) S2 S3 S4 S5 S6 S7 S8",
    "dress code": " Acceptable: Attire which is clean, well maintained and in good taste. Shirts with sleeves and collars, tee-shirts, walking shorts (not shorter than 3\" above the knee), nice jeans/denim, dress slacks, skirts, dresses, jogging suits, dress shoes, open-toe shoes, and nice sneakers. Acceptable: Not Acceptable: Attire that is torn, ragged, slashed, dirty, frayed, low-cut, skimpy, or revealing. Attire with offensive or sexually oriented inscriptions or messages, halter/tube/midriff tops, sweats of any kind, leggings, beach or swimwear, body piercing, tattoos (cover from view), and shoes that are dirty, stained, or worn in appearance. Flip-flops. Not Acceptable:",
    "listing": " Listing is required for all flights and must be done online at myIDTravel. myIDTravel Reservations are no longer accepted via the 800 number and cannot be made at the airport. After listing on a JetBlue flight, you can view the standby list, including where you are priority wise, using the JetBlue mobile app",
    "check-in": " Make sure to check in 24 hours before the flight online. Make sure to check in 24 hours before the flight online. ZED Airlines that subscribe to myIDTravel and receive an electronic ticket are eligible to check-in online at www.jetblue.com or at an airport kiosk up to 24 hours prior to departure. www.jetblue.com ZED Airlines that are traveling with paper tickets must check-in at an airport ticket counter and may do so up to 4 hours prior to departure. JetBlue boards all ZED travelers within the same boarding priority and then based upon time of check-in. Through check-in Through check-in ZED Travelers checking in online should check-in for their outbound segment only. It is not necessary to check-in for your connecting flight. The system will automatically place you on the standby priority list with a higher boarding priority that other ZED travelers when traveling on through and connecting flights. Those that check-in for both segments online will not receive this priority.",
    "excluded flights": " Flights not operated by JetBlue Airways.",
    "website": " www.jetblue.com/",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your JetBlue staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "JetKonnect Notes",
    "url": "https://stafftraveler.com/en/notes/JLL",
    "general": " Kindly note that you will be required to carry a printout of your e-ticket to gain entry into any Indian airport and for check-in along with valid photo identification as mentioned in the itinerary.",
    "baggage": " As per www.jetairways.com for the class of travel you are ticketed in. www.jetairways.com",
    "dress code": " For travel in Economy For travel in Economy the minimum standard of dress is smart casual: Male: Collared shirt/Polo-shirt and smart casual trousers. Smart jeans and sport shoes may be worn. Female: Dress, trousers or skirt and top with sleeves/knee length skirt/ salwar kameez or sarees. Smart jeans and sport shoes may be worn. Children under 12: Smart casual. Smart jeans and sport shoes may be worn. For travel in Premiere For travel in Premiere the minimum standard of dress is : Male: Long sleeved jacket, collared shirt and smart trousers. A tie is not necessary.(Note: For upgrade to Premiere, Jeans are not permitted). Female: Long sleeved jacket, blouse/smart top with sleeves, knee length skirt, smart trousers, a dress/ salwar kameez or a saree. (Note: For upgrade to Premiere, Jeans are not permitted). Children under 12: Smart casual. Smart jeans and sport shoes may be worn. Certain clothing items are considered unacceptable for travel. These include worn-out/ distressed jeans, baggy jeans, dirty or torn clothes, beach or jogging attire as well as t-shirts, shorts, sleeveless tops, beach shoes and slippers. Skirts and dresses must not be shorter than knee length. Traditional attire is permissible for elderly parents. It is really important that you comply with the dress code otherwise you will be faced with the embarrassing situation of being asked to change. If you do not possess suitable alternative clothing you may not be able to travel. Please ensure you comply with passport and visa requirements for your transit/destination and travel and please co-operate with instructions given to you by the on-duty Jet Airways staff at check-in or onboard the aircraft. The staff travel ticket that is issued is a reduced rate of free ticket and it comes with responsibilities, to follow relevant procedures and guidelines. It is equally important that relatives travelling on such tickets are aware of these requirements and it is your responsibility to ensure they are fully briefed before their departure. We look forward to welcome you onboard.",
    "listing": " Listing is done on Jet Airways flights once ticket is issued via myIDTravel. If the ticket consists any 9W flight between 9W*7000-7999 series, manual listing is required. Manual listing can be done by calling Jet Airways contact center. Contact center communication details are available on www.jetairways.com www.jetairways.com",
    "check-in": " Domestic Check-In Domestic Check-In Check-in usually starts 120 minutes before departure. Passengers are requested to report at least 60 minutes before scheduled time of departure to avoid inconvenience International Check-In International Check-In Check-in usually starts 180 minutes before departure. Passengers are requested to report at least three hours in advance before the scheduled departure to avoid inconvenience.",
    "refunds": " Fully unused tickets will be processed automatically by myIDTravel system. For partial refunds please email interlineoal@jetairways.com & centralhelpdesk@jetairways.com. If you are downgraded from Business to Economy class please send copy of b/pass to interlineoal@jetairways.com & centralhelpdesk@jetairways.com for processing. Partial and Downgrade refunds are processed manually and will take 3 weeks to process. A ticket can be refunded within one year from date of issuance. interlineoal@jetairways.com centralhelpdesk@jetairways.com interlineoal@jetairways.com centralhelpdesk@jetairways.com",
    "special": " Through-travel not available for standby passengers. When planning your trip, please ensure you leave yourself enough time to land and check-in again at any intermediate point.",
    "visa": " For international travel, each passenger must have a valid passport, and must have relevant visas for the destination, and for scheduled point's en-route, in case off-loading becomes necessary. Some countries require Advance Passenger Information System (APIS), and 9W requires that this must be provided before check-in.",
    "email info": " interlineoal@jetairways.com",
    "refunds email": " centralhelpdesk@jetairways.com",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your JetKonnect staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Jetstar Notes",
    "url": "https://stafftraveler.com/en/notes/JST",
    "important": " Staff can’t always see negative loads. JQ staff travel portal it will only go as far as showing 0 (zero), however this could also mean the flight is oversold. Unless the staff entering loads is operational and checking live loads at the airport on CM Altea at -48hrs, the staff travel portal does not indicate if a flight is oversold.",
    "general": " All Jetstar bookings via myIDTravel are issued as ticketless travel. Jetstar bookings are valid for 90 days from the date of issue. Listing is mandatory for Jetstar flights and will be created at the time of booking. On successful completion of your booking, an Itinerary Receipt will be forwarded to you via email. Please ensure you have a copy of your Jetstar Itinerary Receipt for travel on Jetstar operated services as it is a requirement for Immigration and Customs. Please remember to keep a record of your booking reference as this will be required for rebooking, cancellation or refund requests via myIDTravel.",
    "baggage": " Jetstar baggage for passengers is 20kgs. Through Check-in Through Check-in Through check-in is not available to staff travelers on standby travel. When planning your journey, make sure you leave yourself enough time to de-plane and check-in again at any intermediate point.",
    "dress code": " When travelling on Jetstar services travelers must maintain a high standard of dress and grooming. Generally speaking you need to be neat, clean and conservative. Acceptable: Tidy denim jeans, near knee-length dress shorts, including denim are acceptable. Not Acceptable: Tracksuits, jeans with cut off and frayed hems, designer holes etc. Singlets, bare midriffs, strapless tops/dresses, overly revealing clothing, rubber thongs/flip flops or bare feet. Any extremes of leisure wear, including sweatshirts or t-shirts with questionable graphics or language.",
    "check-in": " When booking with Jetstar, your standby online priority is in order of the time and date the listed staff made their booking. The first person to book that flight, will be the first to be onloaded on the flight. At Sydney Airport, queues are categorized as Very Urgent, Urgent, and Normal, based on how soon your flight is closing when you arrive at the airport. Staff travelers are permitted to use the Very Urgent queue.",
    "refunds": " Refund requests for future dated segments will be processed via myIDTravel. Refund requests for past dated segments will be processed manually and can take up to 15 days from receipt of refund request to process. To initiate this please contact: Australia 1300 042 394 or 03 8668 8277 Singapore 800 852 9510 800 852 9510 New Zealand 0800 284 510 Other countries +61 3 8668 8277 The Call Centre is open 7 days a week, 0800-1800 (AEST) Bookings with an issue date exceeding three months are not eligible for refund.",
    "special": " Please be aware the minimum connection times for all Jetstar, Jetstar Asia and Jetstar Japan flights is 1.5 hours.",
    "general phone number": " +61 3 8668 8277",
    "listing phone number": " +61 3 8668 8277",
    "website": " www.jetstar.com",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Jetstar staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Jetstar Japan Notes",
    "url": "https://stafftraveler.com/en/notes/JJP",
    "general": " All Jetstar bookings via myIDTravel are issued as ticketless travel. Jetstar bookings are valid for 90 days from the date of issue. Listing is mandatory for Jetstar flights and will be created at the time of booking. On successful completion of your booking, an Itinerary Receipt will be forwarded to you via email. Please ensure you have a copy of your Jetstar Itinerary Receipt for travel on Jetstar operated services as it is a requirement for Immigration and Customs. Please remember to keep a record of your booking reference as this will be required for rebooking, cancellation or refund requests via myIDTravel.",
    "baggage": " Jetstar baggage for passengers is 20kgs. Through Check-in Through Check-in Through check-in is not available to staff travelers on standby travel. When planning your journey, make sure you leave yourself enough time to de-plane and check-in again at any intermediate point.",
    "dress code": " When travelling on Jetstar services travelers must maintain a high standard of dress and grooming. Generally speaking you need to be neat, clean and conservative. Acceptable: Tidy denim jeans, near knee-length dress shorts, including denim are acceptable. Not Acceptable: Tracksuits, jeans with cut off and frayed hems, designer holes etc. Singlets, bare midriffs, strapless tops/dresses, overly revealing clothing, rubber thongs/flip flops or bare feet. Any extremes of leisure wear, including sweatshirts or t-shirts with questionable graphics or language.",
    "check-in": " Please check your Itinerary Receipt for check-in time information.",
    "refunds": " Refund requests for future dated segments will be processed via myIDTravel. Refund requests for past dated segments will be processed manually and can take up to 15 days from receipt of refund request to process. To initiate this please contact: Australia 1300 042 394 or 03 8668 8277 Singapore 800 852 9510 800 852 9510 New Zealand 0800 284 510 Other countries +61 3 8668 8277 The Call Centre is open 7 days a week, 0800-1800 (AEST) Bookings with an issue date exceeding three months are not eligible for refund.",
    "special": " Please be aware the minimum connection times for all Jetstar, Jetstar Asia and Jetstar Japan flights is 1.5 hours.",
    "general phone number": " +61 3 8668 8277",
    "listing phone number": " +61 3 8668 8277",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Jetstar Japan staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "KLM Notes",
    "url": "https://stafftraveler.com/en/notes/KLM",
    "important": " KLM Loads can currently not be requested on StaffTraveler. We hope to be able to get them back soon.",
    "general": " The KLM Travel Shop can be reached during Dutch business hours at +31 20 649 3960.",
    "baggage": " One piece of maximum 23kgs. In case of additional baggage, the commercial (excess) baggage policy applies.",
    "dress code": " ISA travelers are required to dress appropriately and take care of their appearance. This requires neat casual (business) attire and excludes track/sweat suits, tank tops, flip-flops, shorts and torn and/or extravagant clothing. Neat and tidy jeans are accepted. ISA travelers are not allowed to travel in airline uniform on KLM. Failure to observe this dress code may result in the refusal to accept the individual for travel.",
    "listing": " KLM only accepts electronic ZED-tickets on KLM flights. Interline agreements of airlines that currently have no e-ticketing possibility have consequently been suspended. All listings on KLM flights have to be made via MyIDListing - details of the listing methodology via MyIDListing have been provided to your airlines' staff travel department. In case of a changed travel itinerary all airline staff needs to ensure to cancel the affected listing on KLM flights. Ensure a printed copy of the e-ticket and listing can be shown during the check-in process.",
    "check-in": " See www.klm.com for information on time limits for check-in and baggage drop-off. For check-in, please use Self Service Check-In (SSCI) machines at airports. In case check-in via SSCI appears impossible, please consult with a check-in agent. www.klm.com",
    "boarding": " KLM boards ZED passengers (including KLM staff) according to a so called PSN-number (Priority Serial Number) - KLM staff with a ZED ticket will board first, then AF staff, then staff of Skyteam members, and then all other airline staff. Crew rest seats will not be allocated to OAL staff members traveling on ZED-tickets.",
    "special": " Special meals Special meals Not possible for airline staff traveling on standby Seat requests Seat requests Not possible for airline staff traveling on standby Unaccompanied minors Unaccompanied minors Not possible for airline staff traveling on standby",
    "excluded flights": " A number of the shown KLM-flights contain routes for which KLM does not have commercial traffic rights. On these routes, it is legally not allowed that KLM issues ISA-tickets. Consequently, in some instances (for example due to an offload) it may be required for the ISA traveler to purchase additional commercial or ISA tickets to reach the final destination. In case of final destination KWI(via DMM), DMM (via KWI), EBB (via KGL) and KGL(via EBB) the KLM Ground Staff in Amsterdam will only accept the ISA-traveler to the final destination in case a guarantee exists that the traveler can remain on board until the planned final destination. This acceptance procedure has been decided on due to the strict visa regulations, that don't allow KLM to offload passengers in the intermediate stations.",
    "visa": " Always ensure you have all the correct travel documents with you.",
    "general phone number": " +31 20 6493960",
    "listing phone number": " +31 20 6486945",
    "website": " www.klm.com",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your KLM staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "KLM Cityhopper Notes",
    "url": "https://stafftraveler.com/en/notes/KLC",
    "important": " KLM Loads can currently not be requested on StaffTraveler. We hope to be able to get them back soon.",
    "website": " www.klm.com",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your KLM Cityhopper staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "KM Malta Airlines Notes",
    "url": "https://stafftraveler.com/en/notes/KMM",
    "website": " kmmaltairlines.com/",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your KM Malta Airlines staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Korean Air Notes",
    "url": "https://stafftraveler.com/en/notes/KAL",
    "important": " Korean Air employee system only shows Korean Air's own staff listing . As a result, most times, the number of OAL staff listed will not be reflected with loads provided here. Listed non-rev and seat availability is only updated once a day by Korean Air. As a result, loads and non-rev count you receive may not be real-time nor accurate.",
    "general": " The use of transit counter is strictly limited to revenue passengers only. Therefore, all non-rev passengers coming inbound to Korea will need to clear customs first and show up at the staff check-in counter mentioned below for their seat assignment.",
    "non-rev policy": " Non-rev passengers will only be cleared into Economy class (Y).",
    "baggage": " Same as the Economy class passenger allowance for the route.",
    "listing": " Refer to myIDTravel. If listing is required, call 1588-2001 within Korea or Local Reservations Office.",
    "check-in": " Non-rev passengers must report 60 minutes prior to departure for international flights and 30 minutes for domestic flights. Check desk for airline staff is located at D37 in Terminal 2",
    "boarding": " Korean Air boards according to rows (back to front).",
    "upgrade": " If there are available seats in Business class (C), Korean Air will upgrade revenue passengers to accommodate their own staff members only. OAL non-rev will be restricted to Economy class (Y), regardless of availability in another cabin.",
    "website": " www.koreanair.com",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Korean Air staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "La Compagnie Notes",
    "url": "https://stafftraveler.com/en/notes/DJT",
    "check-in": " La Compagnie does not allow online checkin for Non-rev passsengers, and will not allow non-rev passengers through security without a ticket. Staff will be given a ticket approximately 90 minutes prior to departure. Be sure to check www.lacompagnie.com for accurate departure times as myidtravel is not always correct.",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your La Compagnie staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "LATAM Airlines Notes",
    "url": "https://stafftraveler.com/en/notes/LAN",
    "baggage": " Baggage Allowance:",
    "website": " www.latam.com/",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your LATAM Airlines staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "LATAM Airlines Brasil Notes",
    "url": "https://stafftraveler.com/en/notes/TAM",
    "website": " www.latam.com",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your LATAM Airlines Brasil staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Loganair Notes",
    "url": "https://stafftraveler.com/en/notes/LOG",
    "website": " loganair.co.uk",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Loganair staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Lufthansa Notes",
    "url": "https://stafftraveler.com/en/notes/DLH",
    "general": " Please write down your ticket number. Passenger receipt will be printed out at check-in. The check-in may be done at all LH check-in kiosks and online on www.lufthansa.com. Please contact the helpdesk only in cases of an error. www.lufthansa.com",
    "baggage": " Same baggage allowance as for full fare passengers applies.",
    "dress code": " Eligible Persons travelling under the terms of this agreement must ensure that their appearance and behavior are in line with the Transporting Airline's policy. Eligible Persons must ensure that no inconvenience is given to commercial passengers of the Transporting Airline and that ground staff and cabin crew are not distracted from giving maximum service to such passengers. As a rule, Eligible Persons should be dressed in accordance with public standards of good taste. This will normally mean attire suitable for an office, or smart casual wear. It excludes jeans, T-shirts, sweat-shirts, shorts, gym shoes, and similar extremes of casual wear. Failure to observe the regulations of the Transporting Airline may result in refusal to accept for travel.",
    "listing": " Listing is mandatory via www.myidtravel.com/myidlisting/ www.myidtravel.com/myidlisting/",
    "check-in": " Please check www.lufthansa.com. www.lufthansa.com",
    "upgrade": " Will upgrade full-fare passengers at the gate to accommodate staff travelers in their paid class.",
    "refunds": " All refund requests should be submitted within 4 weeks after travel. Otherwise, the refund process and credit note might take longer. Refund can be done latest 12 months after ticket issuance.",
    "embargoes": " All train and bus services operated under LH flight number.",
    "visa": " The necessary travel documents such as passport, visa or vaccination certificates must be acquired and their validity must be checked by the traveler before starting the trip. LH accepts no responsibility for missing or invalid documents. Fines imposed to LH, resulting from non-compliance with official requirements, will be borne by the traveler. For all travel to India and or transiting India a Visa is always required.",
    "email info": " myidtravel@dlh.de",
    "refunds email": " myidtravel@dlh.de",
    "website": " lufthansa.com/",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Lufthansa staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Lufthansa CityLine Notes",
    "url": "https://stafftraveler.com/en/notes/CLH",
    "website": " www.lufthansa.com",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Lufthansa CityLine staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Luxair Notes",
    "url": "https://stafftraveler.com/en/notes/LGL",
    "important": " Always bring your airline badge with you. If you don't, you might loose priority regarding other staff. When entering the aircraft please introduce yourself to the crew (it's a matter of politeness).",
    "general": " Flight loads and the number of non-revenue passengers for airline flights with a 4-digit flight number are accessible up to 72 hours before departure. They become available again to the crew 2 days before departure (non-rev number is available only 1 day before) and are not updated in real-time but only a couple of times per day. For holiday flights with a 3-digit flight number, loads are updated only once a day, and non-revenue passengers will be visible to the crew one day before the flight.",
    "website": " www.luxair.lu/",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Luxair staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Malaysia Airlines Notes",
    "url": "https://stafftraveler.com/en/notes/MAS",
    "listing": " If you purchase your e-ticket via myIDtravel and your e-ticket number begins with 232 (Malaysia Airlines' ticket stock), no listing is required because you are automatically listed upon ticket issuance. If your e-ticket number does not begin with 232, you must create a meal listing at the nearest MH office or via MH call centre by calling 1300 88 3000 (within Malaysia) and +603-7843 3000 (outside Malaysia) look for local contacts in your country on the MH website. First get on https://www.malaysiaairlines.com/my/en/home.html select my booking enter your Booking Reference: [6-digit alphanumeric] and your last name from your eticket you should see your ticket number and name. To create listing, call the MH Global Contact Centre. scroll up, previously mentioned for e-ticket number does not begin with 232. The call centre agent will ask for you name and phone number in case the call is disconnected. The call centre may be someone working from home in the Phillippines. give the call centre agent your Booking Reference: [6-digit alphanumeric] and tell them it is subload listing, the agent may not understand. ask the agent to add the flight to the booking as it is an open ticket. say: \"may i please trouble you to try to add MH[flight no.] - date of travel to this booking? the booking class should match the fare class of my ticket as staff or zone ticket.\". Just ask them to match the booking class to the fare class. the call centre agent will be able to add the flight to your Booking Reference , when the call centre agent tell you that he/she is able to add the flight, start retriving your booking on MH website again. You should be able to see the flights. (I would print this or send email) now offer let the poor guy go as you have tortured him/her enough with this mind blowing process that he/she has never encountered... But you stream lined the process who has never done a subload listing ever, and it is not in their manual. be very nice and most importantly patient. If the call centre agent says they will have to call you back when the process is completed, decline and say \"to save you time and evergy, I do not think you need to call me back unless there is a serious problem or if there is a problem.\" 4.5 hours later I received an email with my new Booking Reference, I printed another copy. If you do not receive an email, try to retrieve your booking on the mh website again with your Booking Reference from your ticket and see if it is still there. if not, then you may have to call again.",
    "check-in": " At KLIA, the Malaysia Airlines staff standby check-in counter is located in Row C, at the first counter on the left. The sign is on the corner of the counter but may be obstructed. You might only notice the small sign when you’re directly in front of the counter. Ask the staff member near the barrier for assistance, and they will open the barrier to let you in. At Kota Kinabalu International Airport (KBI), The standby counter is now located at desk B20, the far end of the B row.",
    "website": " www.malaysiaairlines.com/",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Malaysia Airlines staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Mesa Airlines Notes",
    "url": "https://stafftraveler.com/en/notes/ASH",
    "website": " www.mesa-air.com",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Mesa Airlines staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Norwegian Notes",
    "url": "https://stafftraveler.com/en/notes/NOZ",
    "important": " Flight loads are available ~24h before departure. SBY passengers figures are not released Boarding will be denied if airline ID cannot be presented on request.",
    "baggage": " Checked baggage: Cabin baggage: Allowance follows the ticket conditions. If on SBY status with checked baggage, it must be processed at a counter.",
    "dress code": " Acceptable attire, smart casual (clean jeans, knee length dress acceptable) no shorts or open toes shoes, no tank tops, gym attire or revealing clothing.",
    "listing": "",
    "check-in": " Norwegian no longer operates flights to South America, the US, or Thailand. Check-in Options: Web/Mobile check-in is available starting 48 hours before departure. Airport check-in is also available – please ensure you meet the official deadlines. If checking in more than 2 hours before departure, passengers will always be assigned SBY (standby), regardless of load. If checking in less than 2 hours before departure and more than 10 seats are available, a seat will be assigned. Check-in is done via self-service kiosks, where boarding passes and bag tags can be printed before dropping baggage at the bag drop. Full details on airport check-in deadlines are available on Norwegian’s website: https://www.norwegian.com/en/travel-info/check-in-and-boarding/check-in-deadlines/",
    "boarding": " If a seat is not assigned once check in is closed a gate agent will assign it st the gate, if not with the commanders discretion Jumpseating is permitted for all ID tickets. ID passengers are assigned to boarding group D and must wait until group C+D is called.",
    "upgrade": " Norwegian no longer operates a Premium cabin, so upgrades are no longer applicable.",
    "refunds": " Within 14 days will be deposited, including no shows.",
    "special": " Meals will be given on availability, please note special meals are not available unless surplus",
    "included flights": " All flights on the Norwegian scheduled network",
    "excluded flights": " D8/DY 9XXX, BY 5XXX, charter destinations",
    "visa": " ESTA/VISA must be valid upon checkin otherwise boarding will be denied. Documents will be checked at the counter.",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Norwegian staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Oman Air Notes",
    "url": "https://stafftraveler.com/en/notes/OMA",
    "website": " www.omanair.com/",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Oman Air staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Pacific Coastal Airlines Notes",
    "url": "https://stafftraveler.com/en/notes/PCO",
    "baggage": " Refer to https://www.pacificcoastal.com/baggage/",
    "dress code": " Overall appearance for employees, registered family members, buddies, and retirees while traveling on passes on all Pacific Coastal flights must be well-groomed, clean and in good taste. Customer Service Agents retain the right to refuse boarding to those wearing unacceptable attire. Acceptable Attire Acceptable Attire Unacceptable Attire Unacceptable Attire",
    "check-in": " Online check-in is the fastest and easiest way to check-in for your flight and is available between 24 hours and 1 hour prior to scheduled departure times. During online check-in you can prepay for checked baggage and obtain an electronic boarding pass. Customers should check-in 60 minutes prior to the scheduled departure time with appropriate government issued identification. Check-in and checked baggage acceptance closes 40 minutes prior to scheduled departure time. Failure to be checked-in prior to closing may result in the cancellation of your entire reservation. As per Transport Canada, Identity Screening Regulations require all passengers who appear 18 years of age or older to present ID at check-in and when boarding. Please ensure that you are present and available for boarding at the departure gate 30 minutes prior to the scheduled departure time of your flight.",
    "infants": " Refer to https://www.pacificcoastal.com/children-travelling/",
    "general phone number": " 1-800-663-2872",
    "listing phone number": " 1-800-663-2872",
    "website": " www.pacificcoastal.com",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Pacific Coastal Airlines staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Perimeter Aviation Notes",
    "url": "https://stafftraveler.com/en/notes/PAG",
    "important": " Loads are available to employees (not on their email and not all employee have access) only one day before schedule departure",
    "baggage": " Each passenger is allowed a total free baggage allowance of 70 pounds (lbs), which includes both checked and carry-on items. A maximum of three pieces is permitted as checked baggage. Due to weight and balance considerations, baggage is not guaranteed to travel on the same flight as the passenger.",
    "dress code": " Presentable Casual Attire The following attire is considered unacceptable: Presentable Casual Attire",
    "listing": " If you require listing from WPG - NON-IATA airport (Perimeter Airport Terminal), please email myidtravel@perimeter.ca.",
    "refunds": " For a refund of an unused ticket, please email myidtravel@perimeter.ca with the following information:",
    "special": " For infants and special service requests, please contact:",
    "email domain": " perimeter.ca",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Perimeter Aviation staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Philippine Airlines Notes",
    "url": "https://stafftraveler.com/en/notes/PAL",
    "general": " PAL confirmed staff on certain flights can comprise between 1/3 to 1/2 of the listed staff. These are accounted for in the booked load.",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Philippine Airlines staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Pivot Airlines Notes",
    "url": "https://stafftraveler.com/en/notes/GGN",
    "email domain": " airgeorgian.ca",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Pivot Airlines staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Porter Airlines Notes",
    "url": "https://stafftraveler.com/en/notes/POE",
    "important": " Standby Eligible Flight Numbers PD101 - PD450 PD2101 - PD2950",
    "general": " Staff have access only to the Economy (Classic) cabin availability. Only a select few have access to the Premium (Reserve) cabin. Dash8-400: 78 seats (72 in Classic and 6 in Reserve) E2-195: 132 seats (116 in Classic and 16 in Reserve) Dash8-400: E2-195: If you see an overselling count, please make the adjustment to the Reserve cabin. However, most of the time you won't know the actual Reserve bookings. For load request inside 1 hour of departure time on the same day, loads might not be provided as the flights are closed. Wifi will be available to all standby travelers free of charge on E195-E2 aircraft.",
    "non-rev policy": " Porter Staff, dependents, parents and pass holders get priority above others. STANDBY ON YOW/YMQ/EWR /YTO: Passengers have the ability to show up at the airport and list themselves to fly on an earlier flight. Many passengers make use of this. These passenger numbers show up on the standby list and they have the highest priority. Therefore on the day of departure, the standby numbers will change by the hour. Also, passengers flying early means the later flights will have more seats available.",
    "baggage": " All non-rev staff are eligible for 2 checked baggage of standard size. Please refer to flyporter.com for baggage specifications.",
    "listing": " Listing is required for each flight. No exceptions on this.",
    "check-in": " All non-rev staff must check-in online or at the check-in counters. Seat numbers will be assigned at the gate. If you are at YTZ the seat numbers will be assigned at the customer service counters past security.",
    "boarding": " Non-rev staff board last. If you have a frequent flyer status, need special assistance or traveling with a child you will get priority.",
    "upgrade": " All non-rev staff are eligible for upgrades. Porter Airlines staff will get priority. Please don't ask for upgrade, the check-in staff will automatically assign you on space available basis. This includes the requirement to meet the inflight services. Irrespective of standby or not, Porter wants everyone to experience proper service. If that cannot be met, the upgrade won't be given.",
    "included flights": " PD101-2989 are eligible for non-rev travel and all other flights are excluded.",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Porter Airlines staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Qantas Notes",
    "url": "https://stafftraveler.com/en/notes/QFA",
    "important": " The Qantas app now displays staff travel information for eligible bookings directly within the app. Staff travel loads and positions are available from 72 hours prior to departure.",
    "general": " Commercial pax upgrades Commercial pax upgrades Qantas has a category for 'commercial pax upgrades' that affects open seat availability by class. Pax can buy upgrades with their reward points. This can cause last-minute changes in the availability per class. Check-in time guidelines for staff travel: Check-in time guidelines for staff travel: 2 hours prior for domestic flights 4 hours prior for international flights These check-in windows will be extended later this year. Possible weight restrictions Possible weight restrictions Weight restrictions may apply to the following flights. | Flight | Route | |--------|---------| | QF001 | SIN-LHR | | QF004 | JFK-AKL | | QF008 | DFW-SYD | | QF009 | PER-LHR | | QF010 | LHR-PER | | QF012 | LAX-SYD | | QF016 | LAX-BNE | | QF022 | DFW-MEL | | QF034 | CDG-PER | | QF074 | SFO-SYD | | QF094 | LAX-MEL |",
    "non-rev policy": " Staff who check in within the recommended times will be given a seat immediately where loads permit. Early check-ins (before the 2 or 4 hour windows) will result in standby only, even if there is enough capacity. These check-in windows will be extended later this year.",
    "baggage": " Qantas economy class commercial baggage allowances apply for staff travelers. Remember that no single item of checked baggage may exceed 32kg (70lb) and all cabin baggage must fit under the seat in front of you or in an overhead locker, including musical instruments. If you exceed the baggage allowance, you must pay any applicable excess baggage charges. At the airport, you will receive a baggage claim tag, but your bags will not be taken at that time. Once your seat is assigned, you can proceed to load your bags. This process ensures that bags are not checked in without the passenger being assigned a seat.",
    "dress code": " When travelling on Qantas services rebate travelers must maintain a high standard of dress and grooming. Generally speaking you need to be neat, clean and conservative. Acceptable: Tidy denim jeans, near knee-length dress shorts, including demin are acceptable. Not Acceptable: Tracksuits, jeans with cut off and frayed hems, designer holes etc. Singlets, bare midriffs, strapless tops/dresses, overly revealing clothing, rubber thongs/flip flops or bare feet. Any extremes of leisure wear, including sweatshirts or t-shirts with questionable graphics or language.",
    "listing": " Flight listings are required by staff travelers for all Qantas and Jetstar flights. Flight listings must be made at least 24 hours prior to travel. Staff travelers without a listing may be refused travel. Qantas flight listings: Qantas flight listings: www.myidtravel.com/myidlisting/ Jetstar flight listings: Jetstar flight listings: 0800 - 1800 (Australian Eastern Standard Time): Australia: 1300 042 394 or +61 3 8668 8277 Singapore: 800 852 9510 800 852 9510 New Zealand: 0800 284 510 Other countries: +61 3 8668 8277",
    "check-in": " Check In Times Check In Times International: 90 - 120 minutes before scheduled departure time Domestic: 45 - 60 minutes before scheduled departure time Checking in at the Airport Checking in at the Airport Sydney Until further notice if you're travelling from Sydney International Terminal there are dedicated staff travel check-in counters located at counter B (north) 10 to 11. Other Australian airports Other Australian airports Self Check-In Kiosks are the fast and easy way to check-in at the airport for domestic flights. Where Self Check-In Kiosks are not available go to the Economy class check-in counters. International Airports International Airports Self Check-In Kiosks to be used where available. (Not available in all ports). Otherwise, Economy Class check-in desks. Through check-in Through check-in Through check-in is not available to staff travelers with standby (space available/subload/ID) tickets. When planning your journey, make sure that you leave yourself enough time to land and check-in again at any intermediate point.",
    "upgrade": " Commercial upgrade requests are generally processed 24 hours before departure.",
    "refunds": " Refund requests for wholly unused e-tickets will be processed automatically. Partially used e-tickets will be processed manually and can take up to 8 weeks from receipt of refund request. E-tickets with an issue date exceeding one year are not eligible for refund.",
    "special": " Special meals Special meals Special meals are not available to any rebate passenger, whether on duty or personal travel. If you have specific dietary needs or preferences which mean that you are unable or unwilling to eat or drink any of the items you are likely to be served on board, you must take your own provisions. Seat requests Seat requests Seat requests are not permitted under any circumstances, whether on travelling on duty or personal travel. If the flight is open, the check-in agent may ask if you want an aisle or a window seat, but this will depend on the commercial load of the flight. Even if you are assigned a specific seat at check-in, you may be moved, even when onboard the aircraft, if it is needed to accommodate commercial requirements. Through check-in is not available to staff travelers on standby travel. When planning your journey, make sure that you leave yourself enough time to de-plane and check-in again at any intermediate point. Children under 16 years cannot travel on any kind of staff travel rebate ticket unless accompanied by an adult travelling on the same type of rebate ticket.",
    "embargoes": " Qantas doesn't generally impose embargoes, but staff travelers are reminded that flights in peak seasons are often full.",
    "general phone number": " +61 3 8668 8277",
    "listing phone number": " +61 3 8668 8277",
    "email info": " shrstafftravelinterline@qantas.com.au",
    "refunds email": " shrstafftravelinterline@qantas.com.au",
    "website": " www.qantas.com",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Qantas staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Qatar Airways Notes",
    "url": "https://stafftraveler.com/en/notes/QTR",
    "important": " Qatar Airways caps loads at +10/+25 until three days before a flight's departure. The exact load details are released three days prior to departure.",
    "baggage": " Always check the website for the most up-to-date information: As per qatarairways.com.",
    "dress code": " Acceptable Attire: Strictly Not Allowed: Tips: Avoid attire that might be misunderstood as restricted to prevent boarding issues.",
    "listing": " Use the new QR listing system or Myidtravel for listing and changes. All standby listings for Economy should be made in RBD E and for Business in RBD U.",
    "check-in": " Confirmed bookings: Use QR website. Standby bookings: Report to check-in counters. Always check the website for the most up-to-date information: As per qatarairways.com.",
    "boarding": " ZED passengers have lower priority over QR revenue passengers. QR staff will have a higher priority over other airline staff holding ZED tickets.",
    "upgrade": " No upgrades for non-revenue passengers.",
    "special": " Meals Pre-booking special meals is not possible. Seats: Seat requests aren't allowed; however, options might be given at check-in if the flight is open. Other Services: No special requests allowed for standby tickets.",
    "infants": " Children under 12 years of age are not allowed to travel in Business class, even if accompanied by an adult. Infant safety seats: Use of safety seat for an infant is not permitted on board.",
    "excluded flights": " QR flight series QR3500-6999 is excluded (subject to change/modifications).",
    "visa": " Ensure all traveling staff and family members hold valid passports and relevant visas for their destinations and stopovers to prevent boarding denial. Traveling staff and their families must have valid passports and visas for their final destinations and any scheduled points en route. Without these, boarding may be denied.",
    "website": " www.qatarairways.com/",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Qatar Airways staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Republic Airways Notes",
    "url": "https://stafftraveler.com/en/notes/RPA",
    "website": " www.rjet.com",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Republic Airways staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Ryanair Notes",
    "url": "https://stafftraveler.com/en/notes/RYR",
    "website": " www.ryanair.com",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Ryanair staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "S7 Airlines Notes",
    "url": "https://stafftraveler.com/en/notes/SBI",
    "email domain": " s7.ru",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your S7 Airlines staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "SAS Notes",
    "url": "https://stafftraveler.com/en/notes/SAS",
    "general": " SAS cabin classes on international short-haul flights are now Business Class and Economy. On domestic flights, Premium and Economy. For long-haul flights, SAS offers three classes: Business Class, Premium, and Economy Class. After adding your booking to the SAS app, flight loads are listed in real time. Figures are available from 72 hours before departure. Note: Waitlisted non-rev are not shown, and provisionally seated standby are counted as booked.",
    "baggage": " Generally, standard rules apply. Certain special baggage cannot be added to unconfirmed tickets.",
    "check-in": " Non-rev check-in is generally available through regular channels, including the SAS app, online, or airport kiosks. Check-in timeframes may vary by flight but are typically available at least 24 hours before departure.",
    "boarding": " On-load typically occurs around boarding time, though provisional acceptance may happen earlier. For Premium and Business Class on long-haul flights, early acceptance should not be expected.",
    "upgrade": " As a non-rev passenger, please do not request upgrades. If needed, revenue passengers will be upgraded to make room for staff travelers in their listed class. SAS has two channels for revenue passenger upgrades: There is no waiting list for revenue upgrades, as accepted or purchased upgrades are processed immediately. Bid acceptance typically starts 24 hours before departure, and availability in Business Class and Premium can change significantly during this period. Not all responders will have access to availability reports that include upgrades.",
    "website": " www.flysas.com/",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your SAS staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "SATA Air Acores Notes",
    "url": "https://stafftraveler.com/en/notes/SAT",
    "important": " COVID-19 Notice Special procedures are in force. Please check azoresairlines.pt for details. S4 flies internacional / SP flies inter island",
    "baggage": " 1 piece with a maximum of 23kgs + 8kgs carry on",
    "dress code": " Casual",
    "listing": " 1. Seniority (retired staff) 2. Seniority (active Staff) 3. Family Members 4. OA, myIDtravel, ZED, etc. 1. 2. 3. 4.",
    "check-in": " Because it is a small airline, non-rev passengers should always contact check in, tell which airline they work for and what they do.",
    "boarding": " With SBY BP wait till you're the last one. If already Accepted board normally.",
    "upgrade": " Non rev are not upgraded on S4. SP has only one class.",
    "refunds": " Should be done through myIDtravel",
    "website": " www.sata.pt",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your SATA Air Acores staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Saudia Notes",
    "url": "https://stafftraveler.com/en/notes/SVA",
    "website": " www.saudia.com/",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Saudia staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Shenzhen Airlines Notes",
    "url": "https://stafftraveler.com/en/notes/CSZ",
    "check-in": " At Shenzhen Airport, the Shenzhen Airlines staff standby check-in counter is located in Row H, counter H01 (left side).",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Shenzhen Airlines staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "SkyWest Airlines Notes",
    "url": "https://stafftraveler.com/en/notes/SKW",
    "website": " www.skywest.com/",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your SkyWest Airlines staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "South African Airways Notes",
    "url": "https://stafftraveler.com/en/notes/SAA",
    "website": " www.flysaa.com/",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your South African Airways staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Southwest Airlines Notes",
    "url": "https://stafftraveler.com/en/notes/SWA",
    "important": " The company has decided to let ALL passengers travel same day standby without a fare increase. This is really throwing off our nonrev predictability You can only see those listings same day once you are checked in for a flight.",
    "general": " All Southwest Airlines tickets issued via myIDTravel are e-ticketed. All nonrevenue travel on Southwest Airlines requires a listing which, is automatically generated when purchasing your nonrevenue travel on Southwest Airlines. Once the e-ticket is generated, you will automatically receive an itinerary receipt via e-mail. If you encounter an issue during the booking process, please send a message to OA_Support@wnco.com. You will need to include a screenshot of any error message in your first e-mail, so that we may look into the situation. Hours of operation are Monday - Friday, 8:00am - 5:00pm (CST). Please be aware that telephone support is not available, and all e-mails will be replied to as quickly as possible. Travel is valid on Southwest operated flights only. OA_Support@wnco.com",
    "baggage": " All standard baggage rules apply.",
    "dress code": " Relaxed and casual however, you, and your eligible travelers must present a clean, well-groomed and tasteful appearance. Acceptable attire includes clean pants or walking shorts without holes, t-shirts that do not bear any offensive/ inappropriate messaging or pictures, polo/button-down shirts, sweaters, or jackets, tennis shoes, loafers, sandals, or flip-flops. Unacceptable nonrevenue attire includes tank tops, outfits with offensive or sexually oriented inscriptions or messages, low-cut, skimpy, revealing clothing, short shorts or gym shorts, torn, ragged, slashed pants/shorts; exposed midriff or halter tops, bare feet, beach or swimwear",
    "listing": " Listing is required for all flights. Please list yourself for travel at least 24 hours in advance.",
    "check-in": " You may add yourself to the standby list up to two hours before your flight's scheduled departure time at the kiosk, ticket counter, or gate. You may also print or reprint a security document at the kiosk. Please check-in with a Customer Service Agent at the ticket counter at least 30 minutes prior to your flight's scheduled departure time. Check-in time matters for priority.",
    "boarding": " Boarding priority is determined by time of check-in. Southwest Airlines Employees and dependents, followed by AirTran Employees and Dependents will be accommodated prior to accommodating other airline space available pass holders.",
    "refunds": " All refund requests must be made via myIDTravel within one year from the date of issue. See above general information for additional details. If you encounter an issue during the refund process, please send a message to oa_support@wnco.com. oa_support@wnco.com",
    "special": " Through check-in Through check-in Passengers are automatically checked in for flights with direct service (one or more stops with no change of aircraft). Passengers making a connection will need to check in again at their point of transfer with an agent at the gate. Checked luggage will be checked through to the passenger's final destination at their point of origin. Seat requests Seat requests Southwest Airlines has an open seating policy. If you have a condition which requires a special seating arrangement, please speak with a Customer Service Agent when checking in at the ticket counter. Pre-boarding is available to nonrevenue passengers who qualify only if a boarding pass can be issued to the passenger prior to general boarding. Infant safety seats Infant safety seats All infants must have a ticket to use an infant safety seat on an aircraft. Proper use of a Child Restraint Systems (CRS) enhances child safety onboard the aircraft. For this reason, Southwest Airlines and the Federal Aviation Administration (FAA) strongly recommend that infants and small children who weigh under 40 pounds be secured in an appropriate CRS when traveling by air. Be sure to check the width of your CRS. Although the width of aircraft seats varies, a safety seat wider than 16 inches is unlikely to fit, even if the armrests of the aircraft seats are moved out of the way. An ill-fitting safety seat will not provide adequate protection for your child. The FAA has banned the use on board aircraft of certain types of CRSs that may be harmful to a child in the event of an aviation emergency. These include backless booster seats, safety belt extensions (commonly referred to as 'belly belts'), and vest or harness devices that attach to an adult. Although some that were manufactured before the FAA's ban may carry an insignia and/or language indicating they are approved for aircraft use, please understand that they are no longer permitted. Approved Child Restraint Systems Approved Child Restraint Systems Harness-type devices approved by the FAA: Harness-type devices approved by the FAA: Unaccompanied minors Unaccompanied minors Children ages five through 11 traveling without an accompanying Passenger age 12 or older must travel as an Unaccompanied Minor (UM) on Southwest Airlines. Southwest Airlines will charge $50 each way ($100 roundtrip) in addition to the air fare per child for UMs to travel. UMs may only travel on nonstop flights. Southwest will not transport UMs on flights that may be diverted or cancelled due to inclement weather or other operational abnormalities. When making a nonrevenue listing for an Unaccompanied Minor, please make sure to have the following information available: Make copies of the UM's itinerary for both the UM and the parent/guardian picking up the child in the destination city.",
    "infants": " Infant/lap child ticketing on domestic Southwest Airlines routes cannot be processed at this time via myIDTravel. You will need to see an Agent at the Southwest Ticket Counter, on the day of travel, so that they may assist you with ticketing for an infant/lap child.",
    "visa": " To comply with the TSA Secure Flight program, please have the following information ready when making your nonrevenue listing:",
    "general phone number": " +1 866-359-7967",
    "listing phone number": " +1 866-359-7967",
    "email info": " oa_support@wnco.com",
    "refunds email": " oa_support@wnco.com",
    "website": " www.southwest.com",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Southwest Airlines staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Spirit Airlines Notes",
    "url": "https://stafftraveler.com/en/notes/NKS",
    "important": " Spirit (NK) loads cannot be checked more than 30 days in advance",
    "general": " Please do not pre-board with the crew.",
    "baggage": " Carry-On Bag Policy Spirit allows for one (1) free carry-on at no charge for each non-revenue traveler. Maximum of 22 x 18 x10 inches (56 x 46 x 25 cm) including handles and wheels. Spirit additionally allows for one (1) free personal item (purse, small backpack, etc.) for under seat storage. Dimensions must not exceed 18 x 14 x 8 inches (45 x 35 x 20 cm) including handles and wheels. Checked Bag Policy Spirit allows for one (1) free checked bag. Maximum weight is 50 pounds (22.6 kg) and maximum size is 62 inches (158 cm)(length + width + height) per checked piece of luggage. Any bag that exceeds these dimensions or weight limit is considered oversized/overweight and has a corresponding charge. Spirit does not accept bags that weigh more than 100 pounds (45 kg) or that measure more than 80 linear inches (203 cm) in overall dimensions. Additional bags may be purchased on spirit.com under Manage Travel at the regular guest rate. (Tip: Purchasing additional bags is cheaper before/during Check-In versus at the airport)",
    "dress code": " All travelers utilizing employee non-rev benefits are expected to look the part and meet personal appearance guidelines outlined in the Spirit Team Member Handbook. Sign in using your Spirit RA credentials. Some airlines that Spirit has agreements with may have slightly different dress codes therefore it is recommended that you dress business casual.",
    "listing": " Please list yourself.",
    "boarding": " Non-rev status for Spirit Airlines is awarded by system seniority. Not first come first serve. First come, first serve is ONLY for the Jumpseat on the A319s and A321s.",
    "website": " www.spirit.com/",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Spirit Airlines staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Sun Country Airlines Notes",
    "url": "https://stafftraveler.com/en/notes/SCX",
    "website": " www.suncountry.com",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Sun Country Airlines staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "SunExpress Deutschland Notes",
    "url": "https://stafftraveler.com/en/notes/SXD",
    "website": " www.sunexpress.com/",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your SunExpress Deutschland staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Swiss Notes",
    "url": "https://stafftraveler.com/en/notes/SWR",
    "special": " If the flight is empty enough, Swiss allows for advance seat selection from online check-in.",
    "website": " www.swiss.com/",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Swiss staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "TAP Air Portugal Notes",
    "url": "https://stafftraveler.com/en/notes/TAP",
    "website": " www.flytap.com/",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your TAP Air Portugal staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Thai Airways International Notes",
    "url": "https://stafftraveler.com/en/notes/THA",
    "important": " PSSI system of THAI. Whenever there are more than 9 seats available in C class the system will show 9+. Whenever there are more than 30 seats available, it will show 30+. Numbers below that are accurate.",
    "website": " www.thaiairways.com/",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Thai Airways International staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Tigerair Australia Notes",
    "url": "https://stafftraveler.com/en/notes/TGG",
    "important": " Timely message for staff travelers trying to depart DPS Overnight: Tigerair Australia has been informed that Indonesian authorities will not be providing Tigerair with the final approval needed to operate to and from Bali from today, Friday 3 February 2017. The Indonesian authorities have informed Tigerair that they require an alternative regulatory solution for Tigerair's operations to Bali. This solution would take at least six months to implement and would compromise the airline's ability to offer low-cost airfares to travelers to Bali. As a result of this development, Tigerair Australia has made the difficult decision to withdraw from flying between Australia and Bali permanently, effective today Friday 3 February 2017.",
    "website": " tigerair.com.au/",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Tigerair Australia staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Transavia Notes",
    "url": "https://stafftraveler.com/en/notes/TRA",
    "general": " Transavia is pleased to welcome airline staff and their eligible travelers. To learn more about Transavia and to see where we fly, please visit our website transavia.com.",
    "baggage": " One piece of hold luggage (max 20kg) per passenger (infant is allowed 10kg in hold). Cabin luggage: 1 cabin bag (55x40x25 cm) not guaranteed on board and 1 piece of hand luggage (40x30x20 cm) with a total weight of max 10kg. The standard commercial baggage policy applies for excess. Extra kilos and Special Service Requests (SSR) can only be purchased at the airport on the day of departure.",
    "listing": " Transavia is a ticketless airline, you receive your booking confirmation via e-mail with a booking reference (PNR).",
    "check-in": " Most checkin desks are open between 2 hours and 40 minutes before departure, check the exact times on our website. www.transavia.com Intinerary receipt and proof of identity will be requested at the check in.",
    "refunds": " Cancellations should be requested in myIDtravel via Manage Booking & Tickets. Refunds are processed automatically when canceling. If you encounter a cancellation or refund error, please include PNR and screenshot(s) in the email communication. Check ID agreement ‘HV’ in myIDTravel for email adres in case of errors.",
    "special": " Meals and beverages are paid",
    "excluded flights": " Flight number between HV1 – HV99 and HV7000 – HV8999",
    "embargoes": " Please see ID agreement information on myIDTravel website",
    "website": " transavia.com",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Transavia staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "TUIfly Notes",
    "url": "https://stafftraveler.com/en/notes/TUI",
    "email domain": " tuifly.com",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your TUIfly staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Turkish Airlines Notes",
    "url": "https://stafftraveler.com/en/notes/THY",
    "important": " Loads become available 72 hours before the departure of a flight.",
    "baggage": " Same baggage allowance as for full fare passengers applies. Free baggage allowance on TK direct flights originating from North America (NYC, WAS, CHI, LAX and YTO) is 2 pieces. Free baggage allowance on North American Interline flights that include other carriers is 1 piece. For more information on Free Baggage Allowances and Excess Baggage Charges please check the Turkish Airlines website Turkish Airlines website",
    "listing": " There is no listing for TK flights. But rebooking is possible via myIDTravel, if the date on the ticket is not expired. Rebookings can be done by keeping the date active. If the date is expired, it is not possible to make rebooking. In this case, the ticket number should be kept and presented at the time of check-in.",
    "upgrade": " Turkish Airlines will not upgrade non-revenue passengers. Normal policy is to upgrade revenue pax to make room for any staff. Select Star Alliance airlines are able to book a business class ZED fair ticket through myIDTravel by selecting business as the class of travel when searching and booking flights with TK.",
    "refunds": " Please retrieve PNR to cancel your flight segment afterwards retrieve the ticket and do the refund (total/partly) in myIDTravel. Partially Refund requests are processed manually and may take longer. For partial refunds please send email to zedinfo@thy.com. Refund can be done latest 12 months after ticket issuance. zedinfo@thy.com",
    "special": " One set of golf equipment, first pair of water ski/ski equipment can be carried free in our flights. Second pair of these items and other items like surf, tents, inflatable boats, scuba equipment, empty dive tank, parachute, ice hockey, paraglide, hang-glide, canoe, archery, mountain climbing, rafting equipment and bicycle are considered exemption of the passenger's baggage weight allowance and they are priced according to Turkish Airlines' special baggage tariff.",
    "included flights": " Charter flights & all code share flights not operated by TK (TK7800-9300)",
    "embargoes": " MLE/CMB v.s flights.",
    "email info": " zedinfo@thy.com",
    "refunds email": " zedinfo@thy.com",
    "website": " www.turkishairlines.com",
    "email domain": " thy.com",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Turkish Airlines staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "United Airlines Notes",
    "url": "https://stafftraveler.com/en/notes/UAL",
    "important": " United Airlines flight loads are only visible 30 days out.",
    "baggage": " United Airlines allows one free checked baggage per ticketed customer. per bag. Size and weight limitations apply. All applicable excess, overweight, oversized checked baggage fees apply, consistent with revenue customer charges. Maximum weight is 50 pounds and maximum size is 62 inches (length + width + height) per checked piece of luggage.",
    "dress code": " Pass rider's overall appearance should be well-groomed, neat, clean and in good taste. Attire should be respectful of fellow revenue passengers, and pass riders. Pass riders may wear denim attire, such as jeans. Shorts that are no more than three inches above the knee. The following attire is unacceptable in any cabin but not limited to: Attire that reveals midriff; attire that reveals any type of undergarments; attire that is designed as sleepwear, underwear or swim attire. Mini Skirts; shorts that are shorter than three inches above the knee when in a standing position. Form-fitting lycra/spances tops, pants and dresses. Attire that has derogatory terminology of graphics. Attire that is excessively dirty or has holes/tears. Any attire that is provocative, inappropriately revealing or see-through. Bare feet; beach-type, rubber flip-flops. All pass riders are responsible to ensure that all of their pass riders are dressed appropriately for pass travel on United/United Express Airlines.",
    "listing": " Flight listings must be made at least 48 hours in advance of travel for international flights and 12 hours in advance for all other flights.",
    "upgrade": " United only upgrades non-revenue passengers who make their listing in business or first class. Otherwise, passengers are placed in economy even if there are available first/business class seats.",
    "refunds": " When requesting a refund, once one e-ticket has been refunded all e-tickets associated with the same record locator will be refunded as well.",
    "special": " SYD - LAX flights may be weight limited",
    "infants": " Infant/lap child e-ticketing on United Airlines cannot be processed at this time via myIDTravel. You will need to see an Agent at the United Ticket Counter, on the day of travel, so that they may assist you with ticketing for an infant/lap child.",
    "included flights": " All United Express flights operated by Air Wisconsin, CommutAir, ExpressJet, GoJet, Mesa Airlines, Republic Airlines, SkyWest Airlines, TransStates Airlines are included.",
    "excluded flights": " Codeshare flights",
    "listing phone number": " +1 866 359 3727",
    "email info": " etc@united.com",
    "refunds email": " etc@united.com",
    "website": " www.united.com/",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your United Airlines staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Virgin America Notes",
    "url": "https://stafftraveler.com/en/notes/VRD",
    "baggage": " Two free checked bags for non-rev passengers. Stand in the bag drop line if you have checked in a bag via the website or kiosk with bags. Checked bags must be dropped off no later than 45 minutes before departure time for domestic flights and 60 minutes before departure for international flights. Guests who encounter bag delays will need to return to the airport to retrieve their bags. The company will not pay for the bags to be delivered.",
    "dress code": " All guests are expected to dress in good taste when traveling on Virgin America. When dressing for travel, dress as you would for work -- use the good judgment you already have by wearing appropriate attire. If in doubt, don't wear it! GST's (Guest Service Teammate's) judgment will prevail in all matters pertaining to the dress code.",
    "listing": " For those carriers currently holding a ZED agreement on Virgin America, using myIDTravel, you are automatically listed on Virgin America flights. Do not call Virgin America's call center. Should your plans change, please modify, cancel or refund (when applicable) this listing by accessing the myIDTravel system. Be sure to always have your reservation booking code and ticket number (when applicable) with you at all times while traveling on Virgin America.",
    "check-in": " Check-in via Virgin America's website at www.virginamerica.com or kiosk up to 24 hours prior to departure. Also, please arrive at your departure gate no later than 15 minutes prior to the scheduled departure time. www.virginamerica.com",
    "upgrade": " Virgin America does not allow upgrades to First or Main Cabin Select (MCS).",
    "refunds": " Virgin America will refund any balance due back to the original form of payment. Full refunds are automated, please allow 7-10 business days for processing a partial refund. To refund a ticket, retrieve the ticket number and select 'refund'. To verify the refund has been requested, or confirm a refund has been completed retrieve your ticket number for the current ticket/refund status. Further refund assistance contact team.travel@virginamerica.com. Please no listings or flight load requests. team.travel@virginamerica.com",
    "email info": " team.travel@virginamerica.com",
    "refunds email": " team.travel@virginamerica.com",
    "website": " www.virginamerica.com/",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Virgin America staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Virgin Atlantic Notes",
    "url": "https://stafftraveler.com/en/notes/VIR",
    "important": " For information purposes, our load checker does not show non-VS non-rev pax. When we provide load figures, any non-rev listed are only VS staff/family/companions. Unfortunately, this leads to some other airline non-rev pax who have a Passenger Locator number (therefore listed) but don't show up on our figures as shown on the StaffTraveller app, to assume that we have provided inaccurate load figures.",
    "baggage": " Virgin Atlantic Economy classic baggage allowance applies.",
    "dress code": " When traveling on Virgin Atlantic, staff and their family and companions must always maintain a smart, clean and tidy appearance.",
    "listing": " Standby listing on all Virgin Atlantic Airways flights is mandatory. If you purchased your e-ticket through myIDTravel and your ticket number begins 932 (Virgin Atlantic ticket stock) a listing is made automatically at the time the ticket is issued. No further action is necessary. If you purchased your e-ticket through myIDTravel and your ticket number does not begin with 932 (i.e. it begins with your own airline ticket stock number) or if you purchased your ticket from your airline directly, you must create a listing through local Virgin Atlantic Reservations Offices",
    "excluded flights": " All codeshare flights are excluded, flight ranges VS2000-2999, 4000-4999, 5000-5999, 6000-6999, 7000-7999, 8000-8999 & 9000-9999.",
    "listing phone number": " +44 (0) 344 742 4390",
    "email info": " stafftravelhub@fly.virgin.com",
    "refunds email": " refunds.hq@fly.virgin.com",
    "website": " www.virginatlantic.com",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Virgin Atlantic staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Virgin Australia Notes",
    "url": "https://stafftraveler.com/en/notes/VOZ",
    "important": " Virgin Australia International flights with flight numbers VA1-VA29 are operated by Qatar airways on behalf of virgin australia. The ability to list on these services are open for VA staff from 01 October. Loads will not be accessible.",
    "general": " Virgin Australia will upgrade revenue guests to accommodate staff travelers into their booked cabin.",
    "baggage": " Staff travel tickets (like full fare tickets) include 1 complimentary checked in bag for domestic/short haul international flights. This can weigh up to 23kgs, with two carry on bags weighing up to a combined total of 7kgs. More baggage can be purchased at the airport.",
    "dress code": " When traveling on Virgin Australia, staff and their family and companions must always maintain a smart, clean and tidy appearance.",
    "check-in": " International staff travel booking onloads are granted on the date you booked the flight. Domestic onloads are granted as followed. E1's are actual staff and travel partners, E2's are group one extended and E3's are a 'buddy' staff travel ticket. If you have the same type of ticket as someone else, it then goes off date of actual booking. Staff from other airlines is last to board.",
    "website": " www.virginaustralia.com",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Virgin Australia staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "VivaAerobus Notes",
    "url": "https://stafftraveler.com/en/notes/VIV",
    "important": " The number of listed non-rev pax may not be available.",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your VivaAerobus staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Volotea Notes",
    "url": "https://stafftraveler.com/en/notes/VOE",
    "email domain": " volotea.com",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Volotea staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Vueling Notes",
    "url": "https://stafftraveler.com/en/notes/VLG",
    "website": " www.vueling.com/en",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Vueling staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "WestJet Notes",
    "url": "https://stafftraveler.com/en/notes/WJA",
    "important": " Westjet only provides loads for all seat availability. There is an economy plus cabin but it isn't separated in our load info. WS doesn’t provide class break down. Just seats of 40 or under available for the Q-400/737-7 737-8/ or max WestJet airlines flight numbers 2600-2999 are sunwing vacations flights and are not eligible for booking standby.",
    "general": " Our offices are located in Canada, and are open Mon-Fri from 0700-1700 MST, closed on weekends and STAT holidays. Westjet currently does not oversell flights. Employees can only book standby flights two weeks in advance. All standby travellers must adhere to a business casual dress code. Standby travellers may be offered an upgrade based on availability and priority.",
    "baggage": " Checked bags cut off 45 minutes to departure. Please see our website for the most up to date information: ww.westjet.com/en-ca/travel-info/baggage/index ww.westjet.com/en-ca/travel-info/baggage/index It is a Transport Canada requirement for checked baggage to be transported with a guest on the same flight. The checked baggage must not depart on a flight prior to the guest. If you are bumped from a flight your baggage will be pulled. Checked baggage exceeding the weight, size and/or the number of pieces per guest are subject to fees as well as space and weight availability for transport. Baggage will be checked to the WestJet final destination or the approved interline final destination as indicated on the guest's itinerary. Checked Baggage Dimensions: Checked Baggage Dimensions: Each guest is permitted to check one piece of baggage at no charge providing the items meet the following size and weight allowance: Carry on baggage: Carry on baggage: One free piece of carry-on baggage and one personal item per guest in a paid seat. Maximum size carry on 53 cm x 23 cm x38 cm (21\"x 9\" x 15\" ) Maximum size personal item 41 cm x 15 cm x 33 cm (16\" x 6\" x 13\") Child/Infant Baggage Allowance Child/Infant Baggage Allowance Lap Held Infant Fare Paying child/infant One piece of child/infant equipment (e.g. approved restraint system, playpen or stroller) will be permitted at no charge in addition to the checked baggage allowance",
    "dress code": " Business casual. No sandals, ripped jeans, short skirts, bare shoulders.",
    "listing": " Listing will been completed through myIDTravel. If you are bumped from a flight you may be asked to relist via myIDTravel, please see a WestJet representative at the airport.",
    "check-in": " Within Canada - You may present yourself at our check in counters no more than 3 hours prior to fight time. Check in must be completed 60 minutes before scheduled departure times. Within Canada Any trans-border – You may present yourself at our check in counters no more than 3 hours prior to fight time. Check in must be completed 2 hours prior to scheduled departure time. Any trans-border",
    "boarding": " When there are two or more interline employees travelling on the same flight, the time of check-in at the station where you are boarding your flight will determine the onload/offload order.",
    "upgrade": " If available will be offered an upgrade based off priority.",
    "refunds": " Refunds on fully cancelled itineraries will appear on your credit card within 3-5 business days. Refunds on partially-flown itineraries will be processed within 30 days of cancellation. If you need further assistance please contact myidtravel@westjet.com with your Airline and employee number. myidtravel@westjet.com",
    "special": " Please advise our reservation agents at the time of listing. Lap Held infants cannot be processed via myIDTravel at this time. If you are traveling with an infant WS asks that you email myidtravel@westjet.com with the following details at least 5 days prior to your intended travel date. We will add the infant to your existing itinerary and email the updated PNR to you. International taxes are applicable for infant tickets. myidtravel@westjet.com Infants traveling on last-minute bookings and trans-border flights will be ticketed at the airport. Plan for a few extra minutes at Check-in.",
    "infants": " If you wish to use an infant seat you will be required to purchase a child ticket as they will require a seat.",
    "excluded flights": " WS5000-WS9999",
    "general phone number": " +1 877 I FLY WJA",
    "email info": " myidtravel@westjet.com",
    "refunds email": " myidtravel@westjet.com",
    "website": " www.westjet.com/",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your WestJet staff travel notes to StaffTraveler"
  },
  {
    "airline_name": "Wideroe Notes",
    "url": "https://stafftraveler.com/en/notes/WIF",
    "website": " www.wideroe.no/",
    "stafftraveler esim": "Try the StaffTraveler eSIM for free",
    "submit your airline notes": "Add your Wideroe staff travel notes to StaffTraveler"
  }
]